#if 0
;
; Note: shader requires additional functionality:
;       Typed UAV Load Additional Formats
;
; shader debug name: a34c681f09577e086b9737ab18ed7723.pdb
; shader hash: a34c681f09577e086b9737ab18ed7723
;
; Buffer Definitions:
;
; cbuffer Camerab
; {
;
;   struct hostlayout.Camerab
;   {
;
;       float3 camPos;                                ; Offset:    0
;       float pad0;                                   ; Offset:   12
;       row_major float4x4 InvVieProj;                ; Offset:   16
;       float pad1;                                   ; Offset:   80
;   
;   } Camerab;                                        ; Offset:    0 Size:    84
;
; }
;
; Resource bind info for VertexBuffers
; {
;
;   struct struct.Vertex
;   {
;
;       float3 position;                              ; Offset:    0
;       float3 normal;                                ; Offset:   12
;       float2 texcoord;                              ; Offset:   24
;       uint materialIndex;                           ; Offset:   32
;   
;   } $Element;                                       ; Offset:    0 Size:    36
;
; }
;
; Resource bind info for Materials
; {
;
;   struct struct.Material
;   {
;
;       float3 color;                                 ; Offset:    0
;       float roughness;                              ; Offset:   12
;       float metallic;                               ; Offset:   16
;       float ior;                                    ; Offset:   20

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxcoob 1.8.2502.11 (239921522)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !46, globals: !85)
!1 = !DIFile(filename: "raytracingshader.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !14, !23, !31}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 60, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 60, size: 64, align: 32, elements: !6, templateParams: !10)
!6 = !{!7, !9}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 60, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 60, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !{!11, !12}
!11 = !DITemplateTypeParameter(name: "element", type: !8)
!12 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 2)
!13 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 67, baseType: !15)
!15 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 67, size: 128, align: 32, elements: !16, templateParams: !21)
!16 = !{!17, !18, !19, !20}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !15, file: !1, line: 67, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !15, file: !1, line: 67, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !15, file: !1, line: 67, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !15, file: !1, line: 67, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!21 = !{!11, !22}
!22 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 4)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 41, baseType: !24)
!24 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 41, size: 96, align: 32, elements: !25, templateParams: !29)
!25 = !{!26, !27, !28}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !24, file: !1, line: 41, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !24, file: !1, line: 41, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !24, file: !1, line: 41, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!29 = !{!11, !30}
!30 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 3)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3x3", file: !1, line: 140, baseType: !32)
!32 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 3, 3>", file: !1, line: 140, size: 288, align: 32, elements: !33, templateParams: !43)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !32, file: !1, line: 140, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !32, file: !1, line: 140, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !32, file: !1, line: 140, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !32, file: !1, line: 140, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !32, file: !1, line: 140, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !32, file: !1, line: 140, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !32, file: !1, line: 140, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !32, file: !1, line: 140, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !32, file: !1, line: 140, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!43 = !{!11, !44, !45}
!44 = !DITemplateValueParameter(name: "row_count", type: !13, value: i32 3)
!45 = !DITemplateValueParameter(name: "col_count", type: !13, value: i32 3)
!46 = !{!47, !50, !65, !76, !79}
!47 = !DISubprogram(name: "RayGeneration", linkageName: "\01?RayGeneration@@YAXXZ", scope: !1, file: !1, line: 53, type: !48, isLocal: false, isDefinition: true, scopeLine: 54, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @"\01?RayGeneration@@YAXXZ")
!48 = !DISubroutineType(types: !49)
!49 = !{null}
!50 = !DISubprogram(name: "Miss", linkageName: "\01?Miss@@YAXUPayload@@@Z", scope: !1, file: !1, line: 103, type: !51, isLocal: false, isDefinition: true, scopeLine: 104, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.Payload*)* @"\01?Miss@@YAXUPayload@@@Z")
!51 = !DISubroutineType(types: !52)
!52 = !{null, !53}
!53 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !54)
!54 = !DICompositeType(tag: DW_TAG_structure_type, name: "Payload", file: !1, line: 1, size: 448, align: 32, elements: !55)
!55 = !{!56, !57, !58, !59, !60, !63}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "throughput", scope: !54, file: !1, line: 3, baseType: !23, size: 96, align: 32)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !54, file: !1, line: 4, baseType: !23, size: 96, align: 32, offset: 96)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "newPos", scope: !54, file: !1, line: 5, baseType: !23, size: 96, align: 32, offset: 192)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "newDir", scope: !54, file: !1, line: 6, baseType: !23, size: 96, align: 32, offset: 288)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "numBounces", scope: !54, file: !1, line: 7, baseType: !61, size: 32, align: 32, offset: 384)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 76, baseType: !62)
!62 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "missed", scope: !54, file: !1, line: 8, baseType: !64, size: 32, align: 32, offset: 416)
!64 = !DIBasicType(name: "bool", size: 32, align: 32, encoding: DW_ATE_boolean)
!65 = !DISubprogram(name: "DirectionSampler", linkageName: "\01?DirectionSampler@@YA?AV?$vector@M$02@@UPayload@@UMaterial@@V1@V?$vector@M$01@@@Z", scope: !1, file: !1, line: 112, type: !66, isLocal: false, isDefinition: true, scopeLine: 113, flags: DIFlagPrototyped, isOptimized: false)
!66 = !DISubroutineType(types: !67)
!67 = !{!23, !53, !68, !23, !4}
!68 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !1, line: 18, size: 256, align: 32, elements: !69)
!69 = !{!70, !71, !72, !73, !74, !75}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !68, file: !1, line: 20, baseType: !23, size: 96, align: 32)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "roughness", scope: !68, file: !1, line: 21, baseType: !8, size: 32, align: 32, offset: 96)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "metallic", scope: !68, file: !1, line: 22, baseType: !8, size: 32, align: 32, offset: 128)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "ior", scope: !68, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 160)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "transmission", scope: !68, file: !1, line: 24, baseType: !8, size: 32, align: 32, offset: 192)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "emission", scope: !68, file: !1, line: 25, baseType: !8, size: 32, align: 32, offset: 224)
!76 = !DISubprogram(name: "Hit", linkageName: "\01?Hit@@YAXUPayload@@V?$vector@M$01@@@Z", scope: !1, file: !1, line: 121, type: !77, isLocal: false, isDefinition: true, scopeLine: 122, flags: DIFlagPrototyped, isOptimized: false)
!77 = !DISubroutineType(types: !78)
!78 = !{null, !53, !4}
!79 = !DISubprogram(name: "ClosestHit", linkageName: "\01?ClosestHit@@YAXUPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !1, file: !1, line: 166, type: !80, isLocal: false, isDefinition: true, scopeLine: 167, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.Payload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ClosestHit@@YAXUPayload@@UBuiltInTriangleIntersectionAttributes@@@Z")
!80 = !DISubroutineType(types: !81)
!81 = !{null, !53, !82}
!82 = !DICompositeType(tag: DW_TAG_structure_type, name: "BuiltInTriangleIntersectionAttributes", file: !1, line: 161, size: 64, align: 32, elements: !83)
!83 = !{!84}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "barycentrics", scope: !82, file: !1, line: 161, baseType: !5, size: 64, align: 32)
!85 = !{!86, !88, !90, !114, !115, !117, !121, !123, !136, !141, !145, !146, !147, !148, !150, !152, !154, !155, !156}
!86 = !DIGlobalVariable(name: "camPos", linkageName: "\01?camPos@Camerab@@3V?$vector@M$02@@B", scope: !0, file: !1, line: 41, type: !87, isLocal: false, isDefinition: true)
!87 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !23)
!88 = !DIGlobalVariable(name: "pad0", linkageName: "\01?pad0@Camerab@@3MB", scope: !0, file: !1, line: 42, type: !89, isLocal: false, isDefinition: true)
!89 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!90 = !DIGlobalVariable(name: "InvVieProj", linkageName: "\01?InvVieProj@Camerab@@3V?$matrix@M$03$03@@B", scope: !0, file: !1, line: 43, type: !91, isLocal: false, isDefinition: true)
!91 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !92)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 43, baseType: !93)
!93 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 43, size: 512, align: 32, elements: !94, templateParams: !111)
!94 = !{!95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !93, file: !1, line: 43, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !93, file: !1, line: 43, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !93, file: !1, line: 43, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !93, file: !1, line: 43, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !93, file: !1, line: 43, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !93, file: !1, line: 43, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !93, file: !1, line: 43, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !93, file: !1, line: 43, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !93, file: !1, line: 43, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !93, file: !1, line: 43, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !93, file: !1, line: 43, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !93, file: !1, line: 43, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !93, file: !1, line: 43, baseType: !8, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !93, file: !1, line: 43, baseType: !8, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !93, file: !1, line: 43, baseType: !8, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !93, file: !1, line: 43, baseType: !8, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!111 = !{!11, !112, !113}
!112 = !DITemplateValueParameter(name: "row_count", type: !13, value: i32 4)
!113 = !DITemplateValueParameter(name: "col_count", type: !13, value: i32 4)
!114 = !DIGlobalVariable(name: "pad1", linkageName: "\01?pad1@Camerab@@3MB", scope: !0, file: !1, line: 44, type: !89, isLocal: false, isDefinition: true)
!115 = !DIGlobalVariable(name: "RAY_FLAG_NONE", scope: !0, file: !1, line: 84, type: !116, isLocal: true, isDefinition: true, variable: i32 0)
!116 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !62)
!117 = !DIGlobalVariable(name: "accumulationTexture", linkageName: "\01?accumulationTexture@@3V?$RWTexture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 29, type: !118, isLocal: false, isDefinition: true, variable: %dx.types.Handle* @"\01?accumulationTexture@@3V?$RWTexture2D@V?$vector@M$03@@@@A")
!118 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<vector<float, 4> >", file: !1, line: 29, size: 128, align: 32, elements: !2, templateParams: !119)
!119 = !{!120}
!120 = !DITemplateTypeParameter(name: "element", type: !15)
!121 = !DIGlobalVariable(name: "scene", linkageName: "\01?scene@@3URaytracingAccelerationStructure@@A", scope: !0, file: !1, line: 31, type: !122, isLocal: false, isDefinition: true, variable: %dx.types.Handle* @"\01?scene@@3URaytracingAccelerationStructure@@A")
!122 = !DICompositeType(tag: DW_TAG_structure_type, name: "RaytracingAccelerationStructure", file: !1, line: 31, size: 32, align: 32, elements: !2)
!123 = !DIGlobalVariable(name: "VertexBuffers", linkageName: "\01?VertexBuffers@@3PAV?$StructuredBuffer@UVertex@@@@A", scope: !0, file: !1, line: 33, type: !124, isLocal: false, isDefinition: true, variable: [0 x %dx.types.Handle]* @"\01?VertexBuffers@@3PAV?$StructuredBuffer@UVertex@@@@A")
!124 = !DICompositeType(tag: DW_TAG_array_type, baseType: !125, size: 288, align: 32, elements: !134)
!125 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<Vertex>", file: !1, line: 33, size: 288, align: 32, elements: !2, templateParams: !126)
!126 = !{!127}
!127 = !DITemplateTypeParameter(name: "element", type: !128)
!128 = !DICompositeType(tag: DW_TAG_structure_type, name: "Vertex", file: !1, line: 11, size: 288, align: 32, elements: !129)
!129 = !{!130, !131, !132, !133}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !128, file: !1, line: 13, baseType: !23, size: 96, align: 32)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "normal", scope: !128, file: !1, line: 14, baseType: !23, size: 96, align: 32, offset: 96)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "texcoord", scope: !128, file: !1, line: 15, baseType: !4, size: 64, align: 32, offset: 192)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "materialIndex", scope: !128, file: !1, line: 16, baseType: !61, size: 32, align: 32, offset: 256)
!134 = !{!135}
!135 = !DISubrange(count: 1)
!136 = !DIGlobalVariable(name: "IndexBuffers", linkageName: "\01?IndexBuffers@@3PAV?$Buffer@I@@A", scope: !0, file: !1, line: 34, type: !137, isLocal: false, isDefinition: true, variable: [0 x %dx.types.Handle]* @"\01?IndexBuffers@@3PAV?$Buffer@I@@A")
!137 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 32, align: 32, elements: !134)
!138 = !DICompositeType(tag: DW_TAG_class_type, name: "Buffer<unsigned int>", file: !1, line: 34, size: 32, align: 32, elements: !2, templateParams: !139)
!139 = !{!140}
!140 = !DITemplateTypeParameter(name: "element", type: !62)
!141 = !DIGlobalVariable(name: "Materials", linkageName: "\01?Materials@@3V?$StructuredBuffer@UMaterial@@@@A", scope: !0, file: !1, line: 36, type: !142, isLocal: false, isDefinition: true, variable: %dx.types.Handle* @"\01?Materials@@3V?$StructuredBuffer@UMaterial@@@@A")
!142 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<Material>", file: !1, line: 36, size: 256, align: 32, elements: !2, templateParams: !143)
!143 = !{!144}
!144 = !DITemplateTypeParameter(name: "element", type: !68)
!145 = !DIGlobalVariable(name: "materialIndexBuffer", linkageName: "\01?materialIndexBuffer@@3V?$Buffer@I@@A", scope: !0, file: !1, line: 37, type: !138, isLocal: false, isDefinition: true, variable: %dx.types.Handle* @"\01?materialIndexBuffer@@3V?$Buffer@I@@A")
!146 = !DIGlobalVariable(name: "skyTop", scope: !0, file: !1, line: 49, type: !87, isLocal: true, isDefinition: true)
!147 = !DIGlobalVariable(name: "skyBottom", scope: !0, file: !1, line: 50, type: !87, isLocal: true, isDefinition: true)
!148 = !DIGlobalVariable(name: "skyBottom.0", linkageName: "skyBottom.0", scope: !0, file: !1, line: 50, type: !149, isLocal: false, isDefinition: true)
!149 = !DIDerivedType(tag: DW_TAG_member, name: ".0", baseType: !87, size: 32, align: 4)
!150 = !DIGlobalVariable(name: "skyBottom.1", linkageName: "skyBottom.1", scope: !0, file: !1, line: 50, type: !151, isLocal: false, isDefinition: true)
!151 = !DIDerivedType(tag: DW_TAG_member, name: ".1", baseType: !87, size: 32, align: 4, offset: 32)
!152 = !DIGlobalVariable(name: "skyBottom.2", linkageName: "skyBottom.2", scope: !0, file: !1, line: 50, type: !153, isLocal: false, isDefinition: true)
!153 = !DIDerivedType(tag: DW_TAG_member, name: ".2", baseType: !87, size: 32, align: 4, offset: 64)
!154 = !DIGlobalVariable(name: "skyTop.0", linkageName: "skyTop.0", scope: !0, file: !1, line: 49, type: !149, isLocal: false, isDefinition: true)
!155 = !DIGlobalVariable(name: "skyTop.1", linkageName: "skyTop.1", scope: !0, file: !1, line: 49, type: !151, isLocal: false, isDefinition: true)
!156 = !DIGlobalVariable(name: "skyTop.2", linkageName: "skyTop.2", scope: !0, file: !1, line: 49, type: !153, isLocal: false, isDefinition: true)
!157 = !{i32 2, !"Dwarf Version", i32 4}
!158 = !{i32 2, !"Debug Info Version", i32 3}
!159 = !{!"dxcoob 1.8.2502.11 (239921522)"}
!160 = !{!"raytracingshader.hlsl", !"struct [raypayload] Payload // 56 bytes\0D\0A{\0D\0A    float3 throughput : read(caller, closesthit, miss) : write(caller, closesthit, miss);\0D\0A    float3 color : read(caller, closesthit, miss) : write(caller, closesthit, miss);\0D\0A    float3 newPos : read(caller, closesthit, miss) : write(caller, closesthit, miss);\0D\0A    float3 newDir : read(caller, closesthit, miss) : write(caller, closesthit, miss);\0D\0A    uint numBounces : read(caller, closesthit, miss) : write(caller, closesthit, miss);\0D\0A    bool missed : read(caller, closesthit, miss) : write(caller, closesthit, miss);\0D\0A};\0D\0A\0D\0Astruct Vertex\0D\0A{\0D\0A    float3 position;\0D\0A    float3 normal;\0D\0A    float2 texcoord;\0D\0A    uint materialIndex;\0D\0A};\0D\0Astruct Material\0D\0A{\0D\0A    float3 color;\0D\0A    float roughness;\0D\0A    float metallic;\0D\0A    float ior;\0D\0A    float transmission;\0D\0A    float emission;\0D\0A};\0D\0A\0D\0A// UAV, SRVs and CBVs\0D\0ARWTexture2D<float4> accumulationTexture : register(u0, space0);\0D\0A\0D\0ARaytracingAccelerationStructure scene : register(t0, space0);\0D\0A\0D\0AStructuredBuffer<Vertex> VertexBuffers[] : register(t1, space1);\0D\0ABuffer<uint> IndexBuffers[] : register(t2, space2);\0D\0A\0D\0AStructuredBuffer<Material> Materials : register(t3, space3);\0D\0ABuffer<uint> materialIndexBuffer : register(t3, space4);\0D\0A\0D\0Acbuffer Camerab : register(b0)\0D\0A{\0D\0A    float3 camPos;\0D\0A    float pad0;\0D\0A    row_major float4x4 InvVieProj;\0D\0A    float pad1;\0D\0A}\0D\0A\0D\0A\0D\0A// constants\0D\0Astatic const float3 skyTop = float3(0.24, 0.44, 0.72);\0D\0Astatic const float3 skyBottom = float3(0.75, 0.86, 0.93);\0D\0A\0D\0A[shader(\22raygeneration\22)]\0D\0Avoid RayGeneration()\0D\0A{\0D\0A    \0D\0A    uint2 launchIndex = DispatchRaysIndex().xy;\0D\0A    uint2 launchDims = DispatchRaysDimensions().xy;\0D\0A    \0D\0A    \0D\0A    float2 uv = (launchIndex + 0.5f) / float2(launchDims);\0D\0A    \0D\0A    // NDC [-1 , 1]\0D\0A    \0D\0A    float2 ndc = uv * 2.0f - 1.0f;\0D\0A    ndc.y = -ndc.y; // flip y\0D\0A    \0D\0A    float4 target = mul(float4(ndc.x, ndc.y, 0.0f, 1.0f), InvVieProj);\0D\0A    float3 worldPos = target.xyz / target.w;\0D\0A   \0D\0A    RayDesc ray;\0D\0A    ray.Origin = camPos;\0D\0A    ray.Direction = normalize(worldPos - camPos);\0D\0A    ray.TMin = 0.001;\0D\0A    ray.TMax = 1e20f;\0D\0A    \0D\0A    Payload payload;\0D\0A    payload.throughput = float3(1.0f, 1.0f, 1.0f);\0D\0A    payload.color = float3(0.0f, 0.0f, 0.0f);\0D\0A    payload.missed = false;\0D\0A    float3 finalColor = float3(0.0f, 0.0f, 0.0f);\0D\0A    \0D\0A    for (uint numBounces = 0; numBounces < 1; numBounces++)\0D\0A    {\0D\0A        TraceRay(scene, RAY_FLAG_NONE, 0xFF, 0, 0, 0, ray, payload);\0D\0A\0D\0A        ray.Origin = payload.newPos;\0D\0A        ray.Direction = payload.newDir;\0D\0A        \0D\0A        finalColor += payload.color * payload.throughput;\0D\0A            \0D\0A        if (payload.missed)\0D\0A        {\0D\0A            break;\0D\0A        }\0D\0A\0D\0A    }\0D\0A    \0D\0A    accumulationTexture[launchIndex] += float4(finalColor, 1.0f);\0D\0A\0D\0A}\0D\0A\0D\0A[shader(\22miss\22)]\0D\0Avoid Miss(inout Payload payload)\0D\0A{\0D\0A    float slope = normalize(WorldRayDirection()).y;\0D\0A    float t = saturate(slope * 5 + 0.5);\0D\0A    payload.color += payload.throughput * lerp(skyBottom, skyTop, t);\0D\0A    \0D\0A    payload.missed = true;\0D\0A}\0D\0A\0D\0Afloat3 DirectionSampler(inout Payload payload, Material mat, float3 worldNormal, float2 uv)\0D\0A{\0D\0A    \0D\0A    float3 newDir = reflect(payload.newDir, worldNormal);\0D\0A    \0D\0A    \0D\0A    return newDir;\0D\0A}\0D\0A\0D\0Avoid Hit(inout Payload payload, float2 uv)\0D\0A{\0D\0A    uint instanceIndex = InstanceIndex(); // auto generated\0D\0A    uint instanceID = InstanceID(); // for vertice/index buffers\0D\0A    uint prim = PrimitiveIndex();\0D\0A\0D\0A    // Fetch triangle indices\0D\0A    uint i0 = IndexBuffers[instanceID][prim * 3 + 0];\0D\0A    uint i1 = IndexBuffers[instanceID][prim * 3 + 1];\0D\0A    uint i2 = IndexBuffers[instanceID][prim * 3 + 2];\0D\0A\0D\0A    // Fetch Vertices\0D\0A    Vertex v0 = VertexBuffers[instanceID][i0];\0D\0A    Vertex v1 = VertexBuffers[instanceID][i1];\0D\0A    Vertex v2 = VertexBuffers[instanceID][i2];\0D\0A\0D\0A    // Interpolate normal from three vertices\0D\0A    float uv0 = 1.0f - uv.x - uv.y;\0D\0A    float3 normal = normalize(v0.normal * uv0 + v1.normal * uv.x + v2.normal * uv.y);\0D\0A    float3 worldNormal = normalize(mul(normal, (float3x3) ObjectToWorld4x3()));\0D\0A\0D\0A    // Fetch material\0D\0A    uint matID = materialIndexBuffer[instanceIndex];\0D\0A    Material mat = Materials[matID];\0D\0A    \0D\0A    // Update ray\0D\0A    float3 rayPos = WorldRayOrigin() + WorldRayDirection() * RayTCurrent();\0D\0A    payload.newPos = rayPos;\0D\0A    \0D\0A    payload.newDir = DirectionSampler(payload, mat, worldNormal, uv);\0D\0A    \0D\0A    \0D\0A    // shading\0D\0A    float3 wi = WorldRayDirection() * -1;\0D\0A    wi = normalize(wi);\0D\0A\0D\0A    float3 throughput = dot(worldNormal, wi);\0D\0A    payload.throughput = throughput;\0D\0A    payload.color =  mat.color;\0D\0A\0D\0A}\0D\0A\0D\0A\0D\0A        \0D\0A[shader(\22closesthit\22)]\0D\0Avoid ClosestHit(inout Payload payload, BuiltInTriangleIntersectionAttributes attribs)\0D\0A{\0D\0A    float2 uv = attribs.barycentrics;\0D\0A    payload.numBounces++;\0D\0A    Hit(payload, uv);\0D\0A    return;\0D\0A    \0D\0A}"}
!161 = !{!"raytracingshader.hlsl"}
!162 = !{!"-E", !"lib.no::entry", !"-T", !"lib_6_8", !"/Fo", !"raytracingshader.cso", !"/Zi", !"-Qembed_debug"}
!163 = !{i32 1, i32 8}
!164 = !{!"lib", i32 6, i32 8}
!165 = !{!166, !176, !179, null}
!166 = !{!167, !169, !171, !173, !175}
!167 = !{i32 0, %struct.RaytracingAccelerationStructure* bitcast (%dx.types.Handle* @"\01?scene@@3URaytracingAccelerationStructure@@A" to %struct.RaytracingAccelerationStructure*), !"scene", i32 0, i32 0, i32 1, i32 16, i32 0, !168}
!168 = !{i32 0, i32 4}
!169 = !{i32 1, [0 x %"class.StructuredBuffer<Vertex>"]* bitcast ([0 x %dx.types.Handle]* @"\01?VertexBuffers@@3PAV?$StructuredBuffer@UVertex@@@@A" to [0 x %"class.StructuredBuffer<Vertex>"]*), !"VertexBuffers", i32 1, i32 1, i32 -1, i32 12, i32 0, !170}
!170 = !{i32 1, i32 36}
!171 = !{i32 2, [0 x %"class.Buffer<unsigned int>"]* bitcast ([0 x %dx.types.Handle]* @"\01?IndexBuffers@@3PAV?$Buffer@I@@A" to [0 x %"class.Buffer<unsigned int>"]*), !"IndexBuffers", i32 2, i32 2, i32 -1, i32 10, i32 0, !172}
!172 = !{i32 0, i32 5}
!173 = !{i32 3, %"class.StructuredBuffer<Material>"* bitcast (%dx.types.Handle* @"\01?Materials@@3V?$StructuredBuffer@UMaterial@@@@A" to %"class.StructuredBuffer<Material>"*), !"Materials", i32 3, i32 3, i32 1, i32 12, i32 0, !174}
!174 = !{i32 1, i32 32}
!175 = !{i32 4, %"class.Buffer<unsigned int>"* bitcast (%dx.types.Handle* @"\01?materialIndexBuffer@@3V?$Buffer@I@@A" to %"class.Buffer<unsigned int>"*), !"materialIndexBuffer", i32 4, i32 3, i32 1, i32 10, i32 0, !172}
!176 = !{!177}
!177 = !{i32 0, %"class.RWTexture2D<vector<float, 4> >"* bitcast (%dx.types.Handle* @"\01?accumulationTexture@@3V?$RWTexture2D@V?$vector@M$03@@@@A" to %"class.RWTexture2D<vector<float, 4> >"*), !"accumulationTexture", i32 0, i32 0, i32 1, i32 2, i1 false, i1 false, i1 false, !178}
!178 = !{i32 0, i32 9}
!179 = !{!180}
!180 = !{i32 0, %hostlayout.Camerab* @Camerab_legacy, !"Camerab", i32 0, i32 0, i32 1, i32 84, null}
!181 = !{i32 0, %"class.StructuredBuffer<Vertex>" undef, !182, %struct.Vertex undef, !187, %"class.StructuredBuffer<Material>" undef, !192, %struct.Material undef, !196, %struct.Payload undef, !203, %struct.BuiltInTriangleIntersectionAttributes undef, !210, %hostlayout.Camerab undef, !212}
!182 = !{i32 44, !183, !184}
!183 = !{i32 6, !"h", i32 3, i32 0}
!184 = !{i32 0, !185}
!185 = !{!186}
!186 = !{i32 0, %struct.Vertex undef}
!187 = !{i32 44, !188, !189, !190, !191}
!188 = !{i32 6, !"position", i32 3, i32 0, i32 7, i32 9, i32 13, i32 3}
!189 = !{i32 6, !"normal", i32 3, i32 16, i32 7, i32 9, i32 13, i32 3}
!190 = !{i32 6, !"texcoord", i32 3, i32 32, i32 7, i32 9, i32 13, i32 2}
!191 = !{i32 6, !"materialIndex", i32 3, i32 40, i32 7, i32 5}
!192 = !{i32 32, !183, !193}
!193 = !{i32 0, !194}
!194 = !{!195}
!195 = !{i32 0, %struct.Material undef}
!196 = !{i32 32, !197, !198, !199, !200, !201, !202}
!197 = !{i32 6, !"color", i32 3, i32 0, i32 7, i32 9, i32 13, i32 3}
!198 = !{i32 6, !"roughness", i32 3, i32 12, i32 7, i32 9}
!199 = !{i32 6, !"metallic", i32 3, i32 16, i32 7, i32 9}
!200 = !{i32 6, !"ior", i32 3, i32 20, i32 7, i32 9}
!201 = !{i32 6, !"transmission", i32 3, i32 24, i32 7, i32 9}
!202 = !{i32 6, !"emission", i32 3, i32 28, i32 7, i32 9}
!203 = !{i32 68, !204, !205, !206, !207, !208, !209}
!204 = !{i32 6, !"throughput", i32 3, i32 0, i32 7, i32 9, i32 13, i32 3}
!205 = !{i32 6, !"color", i32 3, i32 16, i32 7, i32 9, i32 13, i32 3}
!206 = !{i32 6, !"newPos", i32 3, i32 32, i32 7, i32 9, i32 13, i32 3}
!207 = !{i32 6, !"newDir", i32 3, i32 48, i32 7, i32 9, i32 13, i32 3}
!208 = !{i32 6, !"numBounces", i32 3, i32 60, i32 7, i32 5}
!209 = !{i32 6, !"missed", i32 3, i32 64, i32 7, i32 1}
!210 = !{i32 8, !211}
!211 = !{i32 6, !"barycentrics", i32 3, i32 0, i32 7, i32 9, i32 13, i32 2}
!212 = !{i32 84, !213, !214, !215, !217}
!213 = !{i32 6, !"camPos", i32 3, i32 0, i32 7, i32 9, i32 9, i1 true, i32 13, i32 3}
!214 = !{i32 6, !"pad0", i32 3, i32 12, i32 7, i32 9}
!215 = !{i32 6, !"InvVieProj", i32 2, !216, i32 3, i32 16, i32 7, i32 9, i32 9, i1 true}
!216 = !{i32 4, i32 4, i32 1}
!217 = !{i32 6, !"pad1", i32 3, i32 80, i32 7, i32 9}
!218 = !{i32 1, void ()* @"\01?RayGeneration@@YAXXZ", !219, void (%struct.Payload*)* @"\01?Miss@@YAXUPayload@@@Z", !221, void (%struct.Payload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ClosestHit@@YAXUPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !223}
!219 = !{!220}
!220 = !{i32 1, !2, !2}
!221 = !{!220, !222}
!222 = !{i32 2, !2, !2}
!223 = !{!220, !222, !224}
!224 = !{i32 0, !2, !2}
!225 = !{i32 0, %struct.Payload undef, !226}
!226 = !{!227, !227, !227, !227, !227, !227}
!227 = !{i32 0, i32 819}
!228 = !{null, !"", null, !165, !229}
!229 = !{i32 0, i64 8589942800}
!230 = !{void (%struct.Payload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ClosestHit@@YAXUPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !"\01?ClosestHit@@YAXUPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", null, null, !231}
!231 = !{i32 8, i32 10, i32 6, i32 56, i32 7, i32 8, i32 5, !232}
!232 = !{i32 0}
!233 = !{void (%struct.Payload*)* @"\01?Miss@@YAXUPayload@@@Z", !"\01?Miss@@YAXUPayload@@@Z", null, null, !234}
!234 = !{i32 8, i32 11, i32 6, i32 56, i32 5, !232}
!235 = !{void ()* @"\01?RayGeneration@@YAXXZ", !"\01?RayGeneration@@YAXXZ", null, null, !236}
!236 = !{i32 8, i32 7, i32 5, !232}
!237 = !DILocation(line: 84, column: 9, scope: !238)
!238 = distinct !DILexicalBlock(scope: !239, file: !1, line: 83, column: 5)
!239 = distinct !DILexicalBlock(scope: !240, file: !1, line: 82, column: 5)
!240 = distinct !DILexicalBlock(scope: !47, file: !1, line: 82, column: 5)
!241 = !DILocation(line: 98, column: 5, scope: !47)
!242 = !DILocation(line: 56, column: 25, scope: !47)
!243 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "launchIndex", scope: !47, file: !1, line: 56, type: !244)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, line: 56, baseType: !245)
!245 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 56, size: 64, align: 32, elements: !246, templateParams: !249)
!246 = !{!247, !248}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !245, file: !1, line: 56, baseType: !62, size: 32, align: 32, flags: DIFlagPublic)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !245, file: !1, line: 56, baseType: !62, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!249 = !{!140, !12}
!250 = !DIExpression(DW_OP_bit_piece, 0, 32)
!251 = !DILocation(line: 56, column: 11, scope: !47)
!252 = !DIExpression(DW_OP_bit_piece, 32, 32)
!253 = !DILocation(line: 57, column: 24, scope: !47)
!254 = !DILocation(line: 60, column: 18, scope: !47)
!255 = !DILocation(line: 60, column: 30, scope: !47)
!256 = !DILocation(line: 60, column: 40, scope: !47)
!257 = !DILocation(line: 60, column: 38, scope: !47)
!258 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "uv", scope: !47, file: !1, line: 60, type: !4)
!259 = !DILocation(line: 60, column: 12, scope: !47)
!260 = !DILocation(line: 64, column: 21, scope: !47)
!261 = !DILocation(line: 64, column: 28, scope: !47)
!262 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ndc", scope: !47, file: !1, line: 64, type: !4)
!263 = !DILocation(line: 64, column: 12, scope: !47)
!264 = !DILocation(line: 65, column: 13, scope: !47)
!265 = !DILocation(line: 67, column: 59, scope: !47)
!266 = !DILocation(line: 67, column: 21, scope: !47)
!267 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "target", scope: !47, file: !1, line: 67, type: !14)
!268 = !DILocation(line: 67, column: 12, scope: !47)
!269 = !DIExpression(DW_OP_bit_piece, 64, 32)
!270 = !DIExpression(DW_OP_bit_piece, 96, 32)
!271 = !DILocation(line: 68, column: 34, scope: !47)
!272 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "worldPos", scope: !47, file: !1, line: 68, type: !23)
!273 = !DILocation(line: 68, column: 12, scope: !47)
!274 = !DILocation(line: 71, column: 18, scope: !47)
!275 = !DILocation(line: 72, column: 40, scope: !47)
!276 = !DILocation(line: 72, column: 21, scope: !47)
!277 = !DILocation(line: 76, column: 5, scope: !47)
!278 = !DILocation(line: 77, column: 13, scope: !47)
!279 = !DILocation(line: 77, column: 24, scope: !47)
!280 = !{!281, !281, i64 0}
!281 = !{!"omnipotent char", !282, i64 0}
!282 = !{!"Simple C/C++ TBAA"}
!283 = !DILocation(line: 78, column: 13, scope: !47)
!284 = !DILocation(line: 78, column: 19, scope: !47)
!285 = !DILocation(line: 79, column: 13, scope: !47)
!286 = !DILocation(line: 79, column: 20, scope: !47)
!287 = !{!288, !288, i64 0}
!288 = !{!"bool", !281, i64 0}
!289 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "finalColor", scope: !47, file: !1, line: 80, type: !23)
!290 = !DIExpression()
!291 = !DILocation(line: 80, column: 12, scope: !47)
!292 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "numBounces", scope: !240, file: !1, line: 82, type: !61)
!293 = !DILocation(line: 82, column: 15, scope: !240)
!294 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "payload", scope: !47, file: !1, line: 76, type: !54)
!295 = !DILocation(line: 76, column: 13, scope: !47)
!296 = !DILocation(line: 89, column: 31, scope: !238)
!297 = !DILocation(line: 89, column: 47, scope: !238)
!298 = !DILocation(line: 89, column: 37, scope: !238)
!299 = !DILocation(line: 98, column: 38, scope: !47)
!300 = !DILocation(line: 100, column: 1, scope: !47)
!301 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "payload", arg: 1, scope: !50, file: !1, line: 103, type: !54)
!302 = !DILocation(line: 103, column: 25, scope: !50)
!303 = !DILocation(line: 105, column: 29, scope: !50)
!304 = !DILocation(line: 105, column: 19, scope: !50)
!305 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "slope", scope: !50, file: !1, line: 105, type: !8)
!306 = !DILocation(line: 105, column: 11, scope: !50)
!307 = !DILocation(line: 106, column: 30, scope: !50)
!308 = !DILocation(line: 106, column: 34, scope: !50)
!309 = !DILocation(line: 106, column: 15, scope: !50)
!310 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "t", scope: !50, file: !1, line: 106, type: !8)
!311 = !DILocation(line: 106, column: 11, scope: !50)
!312 = !DILocation(line: 107, column: 30, scope: !50)
!313 = !DILocation(line: 107, column: 67, scope: !50)
