#if 0
;
; Note: shader requires additional functionality:
;       Typed UAV Load Additional Formats
;
; shader debug name: 8146c81e92585c0c0c9f4b52276c2594.pdb
; shader hash: 8146c81e92585c0c0c9f4b52276c2594
;
; Buffer Definitions:
;
; cbuffer Camerab
; {
;
;   struct hostlayout.Camerab
;   {
;
;       float3 camPos;                                ; Offset:    0
;       float pad0;                                   ; Offset:   12
;       row_major float4x4 InvVieProj;                ; Offset:   16
;       uint frame;                                   ; Offset:   80
;   
;   } Camerab;                                        ; Offset:    0 Size:    84
;
; }
;
; Resource bind info for VertexBuffers
; {
;
;   struct struct.Vertex
;   {
;
;       float3 position;                              ; Offset:    0
;       float3 normal;                                ; Offset:   12
;       float2 texcoord;                              ; Offset:   24
;       uint materialIndex;                           ; Offset:   32
;   
;   } $Element;                                       ; Offset:    0 Size:    36
;
; }
;
; Resource bind info for Materials
; {
;
;   struct struct.Material
;   {
;
;       float3 color;                                 ; Offset:    0
;       float roughness;                              ; Offset:   12
;       float metallic;                               ; Offset:   16
;       float ior;                                    ; Offset:   20

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxcoob 1.8.2502.11 (239921522)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !46, globals: !115)
!1 = !DIFile(filename: "raytracingshader.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !14, !23, !31}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 63, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 63, size: 64, align: 32, elements: !6, templateParams: !10)
!6 = !{!7, !9}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 63, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 63, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !{!11, !12}
!11 = !DITemplateTypeParameter(name: "element", type: !8)
!12 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 2)
!13 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 70, baseType: !15)
!15 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 70, size: 128, align: 32, elements: !16, templateParams: !21)
!16 = !{!17, !18, !19, !20}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !15, file: !1, line: 70, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !15, file: !1, line: 70, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !15, file: !1, line: 70, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !15, file: !1, line: 70, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!21 = !{!11, !22}
!22 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 4)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 44, baseType: !24)
!24 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 44, size: 96, align: 32, elements: !25, templateParams: !29)
!25 = !{!26, !27, !28}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !24, file: !1, line: 44, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !24, file: !1, line: 44, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !24, file: !1, line: 44, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!29 = !{!11, !30}
!30 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 3)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3x3", file: !1, line: 157, baseType: !32)
!32 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 3, 3>", file: !1, line: 157, size: 288, align: 32, elements: !33, templateParams: !43)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !32, file: !1, line: 157, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !32, file: !1, line: 157, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !32, file: !1, line: 157, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !32, file: !1, line: 157, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !32, file: !1, line: 157, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !32, file: !1, line: 157, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !32, file: !1, line: 157, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !32, file: !1, line: 157, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !32, file: !1, line: 157, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!43 = !{!11, !44, !45}
!44 = !DITemplateValueParameter(name: "row_count", type: !13, value: i32 3)
!45 = !DITemplateValueParameter(name: "col_count", type: !13, value: i32 3)
!46 = !{!47, !50, !61, !65, !70, !73, !76, !79, !102, !103, !106, !112}
!47 = !DISubprogram(name: "RayGeneration", linkageName: "\01?RayGeneration@@YAXXZ", scope: !1, file: !1, line: 57, type: !48, isLocal: false, isDefinition: true, scopeLine: 58, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @"\01?RayGeneration@@YAXXZ")
!48 = !DISubroutineType(types: !49)
!49 = !{null}
!50 = !DISubprogram(name: "random", linkageName: "\01?random@@YAMV?$vector@I$01@@0@Z", scope: !1, file: !1, line: 111, type: !51, isLocal: false, isDefinition: true, scopeLine: 112, flags: DIFlagPrototyped, isOptimized: false)
!51 = !DISubroutineType(types: !52)
!52 = !{!8, !53, !53}
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, line: 60, baseType: !54)
!54 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 60, size: 64, align: 32, elements: !55, templateParams: !59)
!55 = !{!56, !58}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !54, file: !1, line: 60, baseType: !57, size: 32, align: 32, flags: DIFlagPublic)
!57 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !54, file: !1, line: 60, baseType: !57, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!59 = !{!60, !12}
!60 = !DITemplateTypeParameter(name: "element", type: !57)
!61 = !DISubprogram(name: "wang_hash", linkageName: "\01?wang_hash@@YAMI@Z", scope: !1, file: !1, line: 127, type: !62, isLocal: false, isDefinition: true, scopeLine: 128, flags: DIFlagPrototyped, isOptimized: false)
!62 = !DISubroutineType(types: !63)
!63 = !{!8, !64}
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 47, baseType: !57)
!65 = !DISubprogram(name: "randomnew", linkageName: "\01?randomnew@@YAMAIAI@Z", scope: !1, file: !1, line: 139, type: !66, isLocal: false, isDefinition: true, scopeLine: 140, flags: DIFlagPrototyped, isOptimized: false)
!66 = !DISubroutineType(types: !67)
!67 = !{!8, !68}
!68 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !69)
!69 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !64)
!70 = !DISubprogram(name: "SampleHemisphere", linkageName: "\01?SampleHemisphere@@YA?AV?$vector@M$02@@MM@Z", scope: !1, file: !1, line: 148, type: !71, isLocal: false, isDefinition: true, scopeLine: 149, flags: DIFlagPrototyped, isOptimized: false)
!71 = !DISubroutineType(types: !72)
!72 = !{!23, !8, !8}
!73 = !DISubprogram(name: "BuildONB", linkageName: "\01?BuildONB@@YA?AV?$matrix@M$02$02@@V?$vector@M$02@@@Z", scope: !1, file: !1, line: 159, type: !74, isLocal: false, isDefinition: true, scopeLine: 160, flags: DIFlagPrototyped, isOptimized: false)
!74 = !DISubroutineType(types: !75)
!75 = !{!31, !23}
!76 = !DISubprogram(name: "localToWorld", linkageName: "\01?localToWorld@@YA?AV?$vector@M$02@@V1@V?$matrix@M$02$02@@@Z", scope: !1, file: !1, line: 167, type: !77, isLocal: false, isDefinition: true, scopeLine: 168, flags: DIFlagPrototyped, isOptimized: false)
!77 = !DISubroutineType(types: !78)
!78 = !{!23, !23, !31}
!79 = !DISubprogram(name: "DirectionSampler", linkageName: "\01?DirectionSampler@@YA?AV?$vector@M$02@@UPayload@@UMaterial@@V1@V?$vector@M$01@@@Z", scope: !1, file: !1, line: 172, type: !80, isLocal: false, isDefinition: true, scopeLine: 173, flags: DIFlagPrototyped, isOptimized: false)
!80 = !DISubroutineType(types: !81)
!81 = !{!23, !82, !94, !23, !4}
!82 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !83)
!83 = !DICompositeType(tag: DW_TAG_structure_type, name: "Payload", file: !1, line: 1, size: 576, align: 32, elements: !84)
!84 = !{!85, !86, !87, !88, !89, !90, !92, !93}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "throughput", scope: !83, file: !1, line: 3, baseType: !23, size: 96, align: 32)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "emission", scope: !83, file: !1, line: 4, baseType: !23, size: 96, align: 32, offset: 96)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !83, file: !1, line: 5, baseType: !23, size: 96, align: 32, offset: 192)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !83, file: !1, line: 6, baseType: !23, size: 96, align: 32, offset: 288)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "numBounces", scope: !83, file: !1, line: 7, baseType: !64, size: 32, align: 32, offset: 384)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "missed", scope: !83, file: !1, line: 8, baseType: !91, size: 32, align: 32, offset: 416)
!91 = !DIBasicType(name: "bool", size: 32, align: 32, encoding: DW_ATE_boolean)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "pixelIndex", scope: !83, file: !1, line: 9, baseType: !53, size: 64, align: 32, offset: 448)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "dims", scope: !83, file: !1, line: 10, baseType: !53, size: 64, align: 32, offset: 512)
!94 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !1, line: 20, size: 256, align: 32, elements: !95)
!95 = !{!96, !97, !98, !99, !100, !101}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !94, file: !1, line: 22, baseType: !23, size: 96, align: 32)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "roughness", scope: !94, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 96)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "metallic", scope: !94, file: !1, line: 24, baseType: !8, size: 32, align: 32, offset: 128)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "ior", scope: !94, file: !1, line: 25, baseType: !8, size: 32, align: 32, offset: 160)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "transmission", scope: !94, file: !1, line: 26, baseType: !8, size: 32, align: 32, offset: 192)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "emission", scope: !94, file: !1, line: 27, baseType: !8, size: 32, align: 32, offset: 224)
!102 = !DISubprogram(name: "throughputUpdate", linkageName: "\01?throughputUpdate@@YA?AV?$vector@M$02@@UPayload@@UMaterial@@V1@V?$vector@M$01@@@Z", scope: !1, file: !1, line: 191, type: !80, isLocal: false, isDefinition: true, scopeLine: 192, flags: DIFlagPrototyped, isOptimized: false)
!103 = !DISubprogram(name: "Shade", linkageName: "\01?Shade@@YAXUPayload@@V?$vector@M$01@@@Z", scope: !1, file: !1, line: 209, type: !104, isLocal: false, isDefinition: true, scopeLine: 210, flags: DIFlagPrototyped, isOptimized: false)
!104 = !DISubroutineType(types: !105)
!105 = !{null, !82, !4}
!106 = !DISubprogram(name: "ClosestHit", linkageName: "\01?ClosestHit@@YAXUPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !1, file: !1, line: 251, type: !107, isLocal: false, isDefinition: true, scopeLine: 252, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.Payload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ClosestHit@@YAXUPayload@@UBuiltInTriangleIntersectionAttributes@@@Z")
!107 = !DISubroutineType(types: !108)
!108 = !{null, !82, !109}
!109 = !DICompositeType(tag: DW_TAG_structure_type, name: "BuiltInTriangleIntersectionAttributes", file: !1, line: 248, size: 64, align: 32, elements: !110)
!110 = !{!111}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "barycentrics", scope: !109, file: !1, line: 248, baseType: !5, size: 64, align: 32)
!112 = !DISubprogram(name: "Miss", linkageName: "\01?Miss@@YAXUPayload@@@Z", scope: !1, file: !1, line: 263, type: !113, isLocal: false, isDefinition: true, scopeLine: 264, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.Payload*)* @"\01?Miss@@YAXUPayload@@@Z")
!113 = !DISubroutineType(types: !114)
!114 = !{null, !82}
!115 = !{!116, !118, !120, !144, !146, !148, !149, !153, !156, !158, !171, !174, !178, !179, !180, !181}
!116 = !DIGlobalVariable(name: "camPos", linkageName: "\01?camPos@Camerab@@3V?$vector@M$02@@B", scope: !0, file: !1, line: 44, type: !117, isLocal: false, isDefinition: true)
!117 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !23)
!118 = !DIGlobalVariable(name: "pad0", linkageName: "\01?pad0@Camerab@@3MB", scope: !0, file: !1, line: 45, type: !119, isLocal: false, isDefinition: true)
!119 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!120 = !DIGlobalVariable(name: "InvVieProj", linkageName: "\01?InvVieProj@Camerab@@3V?$matrix@M$03$03@@B", scope: !0, file: !1, line: 46, type: !121, isLocal: false, isDefinition: true)
!121 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !122)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 46, baseType: !123)
!123 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 46, size: 512, align: 32, elements: !124, templateParams: !141)
!124 = !{!125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !123, file: !1, line: 46, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !123, file: !1, line: 46, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !123, file: !1, line: 46, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !123, file: !1, line: 46, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !123, file: !1, line: 46, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !123, file: !1, line: 46, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !123, file: !1, line: 46, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !123, file: !1, line: 46, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !123, file: !1, line: 46, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !123, file: !1, line: 46, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !123, file: !1, line: 46, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !123, file: !1, line: 46, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !123, file: !1, line: 46, baseType: !8, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !123, file: !1, line: 46, baseType: !8, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !123, file: !1, line: 46, baseType: !8, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !123, file: !1, line: 46, baseType: !8, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!141 = !{!11, !142, !143}
!142 = !DITemplateValueParameter(name: "row_count", type: !13, value: i32 4)
!143 = !DITemplateValueParameter(name: "col_count", type: !13, value: i32 4)
!144 = !DIGlobalVariable(name: "frame", linkageName: "\01?frame@Camerab@@3IB", scope: !0, file: !1, line: 47, type: !145, isLocal: false, isDefinition: true)
!145 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !64)
!146 = !DIGlobalVariable(name: "RAY_FLAG_NONE", scope: !0, file: !1, line: 90, type: !147, isLocal: true, isDefinition: true, variable: i32 0)
!147 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !57)
!148 = !DIGlobalVariable(name: "PI", scope: !0, file: !1, line: 54, type: !119, isLocal: true, isDefinition: true, variable: float 0x400921FB60000000)
!149 = !DIGlobalVariable(name: "accumulationTexture", linkageName: "\01?accumulationTexture@@3V?$RWTexture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 31, type: !150, isLocal: false, isDefinition: true, variable: %dx.types.Handle* @"\01?accumulationTexture@@3V?$RWTexture2D@V?$vector@M$03@@@@A")
!150 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<vector<float, 4> >", file: !1, line: 31, size: 128, align: 32, elements: !2, templateParams: !151)
!151 = !{!152}
!152 = !DITemplateTypeParameter(name: "element", type: !15)
!153 = !DIGlobalVariable(name: "randPattern", linkageName: "\01?randPattern@@3V?$RWBuffer@I@@A", scope: !0, file: !1, line: 32, type: !154, isLocal: false, isDefinition: true, variable: %dx.types.Handle* @"\01?randPattern@@3V?$RWBuffer@I@@A")
!154 = !DICompositeType(tag: DW_TAG_class_type, name: "RWBuffer<unsigned int>", file: !1, line: 32, size: 32, align: 32, elements: !2, templateParams: !155)
!155 = !{!60}
!156 = !DIGlobalVariable(name: "scene", linkageName: "\01?scene@@3URaytracingAccelerationStructure@@A", scope: !0, file: !1, line: 34, type: !157, isLocal: false, isDefinition: true, variable: %dx.types.Handle* @"\01?scene@@3URaytracingAccelerationStructure@@A")
!157 = !DICompositeType(tag: DW_TAG_structure_type, name: "RaytracingAccelerationStructure", file: !1, line: 34, size: 32, align: 32, elements: !2)
!158 = !DIGlobalVariable(name: "VertexBuffers", linkageName: "\01?VertexBuffers@@3PAV?$StructuredBuffer@UVertex@@@@A", scope: !0, file: !1, line: 36, type: !159, isLocal: false, isDefinition: true, variable: [0 x %dx.types.Handle]* @"\01?VertexBuffers@@3PAV?$StructuredBuffer@UVertex@@@@A")
!159 = !DICompositeType(tag: DW_TAG_array_type, baseType: !160, size: 288, align: 32, elements: !169)
!160 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<Vertex>", file: !1, line: 36, size: 288, align: 32, elements: !2, templateParams: !161)
!161 = !{!162}
!162 = !DITemplateTypeParameter(name: "element", type: !163)
!163 = !DICompositeType(tag: DW_TAG_structure_type, name: "Vertex", file: !1, line: 13, size: 288, align: 32, elements: !164)
!164 = !{!165, !166, !167, !168}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !163, file: !1, line: 15, baseType: !23, size: 96, align: 32)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "normal", scope: !163, file: !1, line: 16, baseType: !23, size: 96, align: 32, offset: 96)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "texcoord", scope: !163, file: !1, line: 17, baseType: !4, size: 64, align: 32, offset: 192)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "materialIndex", scope: !163, file: !1, line: 18, baseType: !64, size: 32, align: 32, offset: 256)
!169 = !{!170}
!170 = !DISubrange(count: 1)
!171 = !DIGlobalVariable(name: "IndexBuffers", linkageName: "\01?IndexBuffers@@3PAV?$Buffer@I@@A", scope: !0, file: !1, line: 37, type: !172, isLocal: false, isDefinition: true, variable: [0 x %dx.types.Handle]* @"\01?IndexBuffers@@3PAV?$Buffer@I@@A")
!172 = !DICompositeType(tag: DW_TAG_array_type, baseType: !173, size: 32, align: 32, elements: !169)
!173 = !DICompositeType(tag: DW_TAG_class_type, name: "Buffer<unsigned int>", file: !1, line: 37, size: 32, align: 32, elements: !2, templateParams: !155)
!174 = !DIGlobalVariable(name: "Materials", linkageName: "\01?Materials@@3V?$StructuredBuffer@UMaterial@@@@A", scope: !0, file: !1, line: 39, type: !175, isLocal: false, isDefinition: true, variable: %dx.types.Handle* @"\01?Materials@@3V?$StructuredBuffer@UMaterial@@@@A")
!175 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<Material>", file: !1, line: 39, size: 256, align: 32, elements: !2, templateParams: !176)
!176 = !{!177}
!177 = !DITemplateTypeParameter(name: "element", type: !94)
!178 = !DIGlobalVariable(name: "materialIndexBuffer", linkageName: "\01?materialIndexBuffer@@3V?$Buffer@I@@A", scope: !0, file: !1, line: 40, type: !173, isLocal: false, isDefinition: true, variable: %dx.types.Handle* @"\01?materialIndexBuffer@@3V?$Buffer@I@@A")
!179 = !DIGlobalVariable(name: "skyTop", scope: !0, file: !1, line: 52, type: !117, isLocal: true, isDefinition: true)
!180 = !DIGlobalVariable(name: "skyBottom", scope: !0, file: !1, line: 53, type: !117, isLocal: true, isDefinition: true)
!181 = !DIGlobalVariable(name: "PI", scope: !0, file: !1, line: 54, type: !119, isLocal: true, isDefinition: true)
!182 = !{i32 2, !"Dwarf Version", i32 4}
!183 = !{i32 2, !"Debug Info Version", i32 3}
!184 = !{!"dxcoob 1.8.2502.11 (239921522)"}
