#if 0
; shader debug name: 131ccd5e818ef604b8270ff763b6608e.pdb
; shader hash: 131ccd5e818ef604b8270ff763b6608e
;
; Buffer Definitions:
;
; Resource bind info for VertexBuffers
; {
;
;   struct struct.Vertex
;   {
;
;       float3 position;                              ; Offset:    0
;       float3 normal;                                ; Offset:   12
;       float2 texcoord;                              ; Offset:   24
;       uint materialIndex;                           ; Offset:   32
;   
;   } $Element;                                       ; Offset:    0 Size:    36
;
; }
;
; Resource bind info for Materials
; {
;
;   struct struct.Material
;   {
;
;       float3 color;                                 ; Offset:    0
;       float roughness;                              ; Offset:   12
;       float metallic;                               ; Offset:   16
;       float ior;                                    ; Offset:   20
;       float transmission;                           ; Offset:   24
;       float emission;                               ; Offset:   28
;   
;   } $Element;                                       ; Offset:    0 Size:    32
;
; }
;
;
; Resource Bindings:
;
; Name                                 Type  Format         Dim      ID      HLSL Bind  Count
; ------------------------------ ---------- ------- ----------- ------- -------------- ------
; scene                             texture     i32         ras      T0             t0     1

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxcoob 1.8.2505.32 (b106a961d)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !39, globals: !70)
!1 = !DIFile(filename: "shader.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !15, !24}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 49, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 49, size: 96, align: 32, elements: !6, templateParams: !11)
!6 = !{!7, !9, !10}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 49, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 49, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 49, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !{!12, !13}
!12 = !DITemplateTypeParameter(name: "element", type: !8)
!13 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 3)
!14 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 64, baseType: !16)
!16 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 64, size: 128, align: 32, elements: !17, templateParams: !22)
!17 = !{!18, !19, !20, !21}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !16, file: !1, line: 64, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !16, file: !1, line: 64, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !16, file: !1, line: 64, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !16, file: !1, line: 64, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!22 = !{!12, !23}
!23 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 4)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3x3", file: !1, line: 93, baseType: !25)
!25 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 3, 3>", file: !1, line: 93, size: 288, align: 32, elements: !26, templateParams: !36)
!26 = !{!27, !28, !29, !30, !31, !32, !33, !34, !35}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !25, file: !1, line: 93, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !25, file: !1, line: 93, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !25, file: !1, line: 93, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !25, file: !1, line: 93, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !25, file: !1, line: 93, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !25, file: !1, line: 93, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !25, file: !1, line: 93, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !25, file: !1, line: 93, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !25, file: !1, line: 93, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!36 = !{!12, !37, !38}
!37 = !DITemplateValueParameter(name: "row_count", type: !14, value: i32 3)
!38 = !DITemplateValueParameter(name: "col_count", type: !14, value: i32 3)
!39 = !{!40, !43, !54, !64}
!40 = !DISubprogram(name: "RayGeneration", linkageName: "\01?RayGeneration@@YAXXZ", scope: !1, file: !1, line: 42, type: !41, isLocal: false, isDefinition: true, scopeLine: 43, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @"\01?RayGeneration@@YAXXZ")
!41 = !DISubroutineType(types: !42)
!42 = !{null}
!43 = !DISubprogram(name: "Miss", linkageName: "\01?Miss@@YAXUPayload@@@Z", scope: !1, file: !1, line: 67, type: !44, isLocal: false, isDefinition: true, scopeLine: 68, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.Payload*)* @"\01?Miss@@YAXUPayload@@@Z")
!44 = !DISubroutineType(types: !45)
!45 = !{null, !46}
!46 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !47)
!47 = !DICompositeType(tag: DW_TAG_structure_type, name: "Payload", file: !1, line: 1, size: 256, align: 32, elements: !48)
!48 = !{!49, !50, !51, !53}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !47, file: !1, line: 3, baseType: !4, size: 96, align: 32)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "throughput", scope: !47, file: !1, line: 4, baseType: !4, size: 96, align: 32, offset: 96)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "allowReflection", scope: !47, file: !1, line: 5, baseType: !52, size: 32, align: 32, offset: 192)
!52 = !DIBasicType(name: "bool", size: 32, align: 32, encoding: DW_ATE_boolean)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "missed", scope: !47, file: !1, line: 6, baseType: !52, size: 32, align: 32, offset: 224)
!54 = !DISubprogram(name: "Hit", linkageName: "\01?Hit@@YAXUPayload@@V?$vector@M$01@@@Z", scope: !1, file: !1, line: 74, type: !55, isLocal: false, isDefinition: true, scopeLine: 75, flags: DIFlagPrototyped, isOptimized: false)
!55 = !DISubroutineType(types: !56)
!56 = !{null, !46, !57}
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 46, baseType: !58)
!58 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 46, size: 64, align: 32, elements: !59, templateParams: !62)
!59 = !{!60, !61}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !58, file: !1, line: 46, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !58, file: !1, line: 46, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!62 = !{!12, !63}
!63 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 2)
!64 = !DISubprogram(name: "ClosestHit", linkageName: "\01?ClosestHit@@YAXUPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !1, file: !1, line: 113, type: !65, isLocal: false, isDefinition: true, scopeLine: 114, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.Payload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ClosestHit@@YAXUPayload@@UBuiltInTriangleIntersectionAttributes@@@Z")
!65 = !DISubroutineType(types: !66)
!66 = !{null, !46, !67}
!67 = !DICompositeType(tag: DW_TAG_structure_type, name: "BuiltInTriangleIntersectionAttributes", file: !1, line: 110, size: 64, align: 32, elements: !68)
!68 = !{!69}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "barycentrics", scope: !67, file: !1, line: 110, baseType: !58, size: 64, align: 32)
!70 = !{!71, !74, !76, !80, !94, !99, !111, !112, !114, !115, !116, !117, !119, !121, !123, !124, !125, !126, !127, !128}
!71 = !DIGlobalVariable(name: "RAY_FLAG_NONE", scope: !0, file: !1, line: 63, type: !72, isLocal: true, isDefinition: true, variable: i32 0)
!72 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !73)
!73 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!74 = !DIGlobalVariable(name: "scene", linkageName: "\01?scene@@3URaytracingAccelerationStructure@@A", scope: !0, file: !1, line: 27, type: !75, isLocal: false, isDefinition: true, variable: %struct.RaytracingAccelerationStructure* @"\01?scene@@3URaytracingAccelerationStructure@@A")
!75 = !DICompositeType(tag: DW_TAG_structure_type, name: "RaytracingAccelerationStructure", file: !1, line: 27, size: 32, align: 32, elements: !2)
!76 = !DIGlobalVariable(name: "uav", linkageName: "\01?uav@@3V?$RWTexture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 28, type: !77, isLocal: false, isDefinition: true, variable: %"class.RWTexture2D<vector<float, 4> >"* @"\01?uav@@3V?$RWTexture2D@V?$vector@M$03@@@@A")
!77 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<vector<float, 4> >", file: !1, line: 28, size: 128, align: 32, elements: !2, templateParams: !78)
!78 = !{!79}
!79 = !DITemplateTypeParameter(name: "element", type: !16)
!80 = !DIGlobalVariable(name: "VertexBuffers", linkageName: "\01?VertexBuffers@@3PAV?$StructuredBuffer@UVertex@@@@A", scope: !0, file: !1, line: 29, type: !81, isLocal: false, isDefinition: true, variable: [0 x %"class.StructuredBuffer<Vertex>"]* @"\01?VertexBuffers@@3PAV?$StructuredBuffer@UVertex@@@@A")
!81 = !DICompositeType(tag: DW_TAG_array_type, baseType: !82, size: 288, align: 32, elements: !92)
!82 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<Vertex>", file: !1, line: 29, size: 288, align: 32, elements: !2, templateParams: !83)
!83 = !{!84}
!84 = !DITemplateTypeParameter(name: "element", type: !85)
!85 = !DICompositeType(tag: DW_TAG_structure_type, name: "Vertex", file: !1, line: 8, size: 288, align: 32, elements: !86)
!86 = !{!87, !88, !89, !90}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !85, file: !1, line: 10, baseType: !4, size: 96, align: 32)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "normal", scope: !85, file: !1, line: 11, baseType: !4, size: 96, align: 32, offset: 96)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "texcoord", scope: !85, file: !1, line: 12, baseType: !57, size: 64, align: 32, offset: 192)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "materialIndex", scope: !85, file: !1, line: 13, baseType: !91, size: 32, align: 32, offset: 256)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 76, baseType: !73)
!92 = !{!93}
!93 = !DISubrange(count: 1)
!94 = !DIGlobalVariable(name: "IndexBuffers", linkageName: "\01?IndexBuffers@@3PAV?$Buffer@I@@A", scope: !0, file: !1, line: 30, type: !95, isLocal: false, isDefinition: true, variable: [0 x %"class.Buffer<unsigned int>"]* @"\01?IndexBuffers@@3PAV?$Buffer@I@@A")
!95 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 32, align: 32, elements: !92)
!96 = !DICompositeType(tag: DW_TAG_class_type, name: "Buffer<unsigned int>", file: !1, line: 30, size: 32, align: 32, elements: !2, templateParams: !97)
!97 = !{!98}
!98 = !DITemplateTypeParameter(name: "element", type: !73)
!99 = !DIGlobalVariable(name: "Materials", linkageName: "\01?Materials@@3V?$StructuredBuffer@UMaterial@@@@A", scope: !0, file: !1, line: 32, type: !100, isLocal: false, isDefinition: true, variable: %"class.StructuredBuffer<Material>"* @"\01?Materials@@3V?$StructuredBuffer@UMaterial@@@@A")
!100 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<Material>", file: !1, line: 32, size: 256, align: 32, elements: !2, templateParams: !101)
!101 = !{!102}
!102 = !DITemplateTypeParameter(name: "element", type: !103)
!103 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !1, line: 15, size: 256, align: 32, elements: !104)
!104 = !{!105, !106, !107, !108, !109, !110}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !103, file: !1, line: 17, baseType: !4, size: 96, align: 32)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "roughness", scope: !103, file: !1, line: 18, baseType: !8, size: 32, align: 32, offset: 96)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "metallic", scope: !103, file: !1, line: 19, baseType: !8, size: 32, align: 32, offset: 128)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "ior", scope: !103, file: !1, line: 20, baseType: !8, size: 32, align: 32, offset: 160)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "transmission", scope: !103, file: !1, line: 21, baseType: !8, size: 32, align: 32, offset: 192)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "emission", scope: !103, file: !1, line: 22, baseType: !8, size: 32, align: 32, offset: 224)
!111 = !DIGlobalVariable(name: "materialIndexBuffer", linkageName: "\01?materialIndexBuffer@@3V?$Buffer@I@@A", scope: !0, file: !1, line: 33, type: !96, isLocal: false, isDefinition: true, variable: %"class.Buffer<unsigned int>"* @"\01?materialIndexBuffer@@3V?$Buffer@I@@A")
!112 = !DIGlobalVariable(name: "camera", scope: !0, file: !1, line: 37, type: !113, isLocal: true, isDefinition: true)
!113 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!114 = !DIGlobalVariable(name: "light", scope: !0, file: !1, line: 38, type: !113, isLocal: true, isDefinition: true)
!115 = !DIGlobalVariable(name: "skyTop", scope: !0, file: !1, line: 39, type: !113, isLocal: true, isDefinition: true)
!116 = !DIGlobalVariable(name: "skyBottom", scope: !0, file: !1, line: 40, type: !113, isLocal: true, isDefinition: true)
!117 = !DIGlobalVariable(name: "camera.0", linkageName: "camera.0", scope: !0, file: !1, line: 37, type: !118, isLocal: false, isDefinition: true)
!118 = !DIDerivedType(tag: DW_TAG_member, name: ".0", baseType: !113, size: 32, align: 4)
!119 = !DIGlobalVariable(name: "camera.1", linkageName: "camera.1", scope: !0, file: !1, line: 37, type: !120, isLocal: false, isDefinition: true)
!120 = !DIDerivedType(tag: DW_TAG_member, name: ".1", baseType: !113, size: 32, align: 4, offset: 32)
!121 = !DIGlobalVariable(name: "camera.2", linkageName: "camera.2", scope: !0, file: !1, line: 37, type: !122, isLocal: false, isDefinition: true)
!122 = !DIDerivedType(tag: DW_TAG_member, name: ".2", baseType: !113, size: 32, align: 4, offset: 64)
!123 = !DIGlobalVariable(name: "skyBottom.0", linkageName: "skyBottom.0", scope: !0, file: !1, line: 40, type: !118, isLocal: false, isDefinition: true)
!124 = !DIGlobalVariable(name: "skyBottom.1", linkageName: "skyBottom.1", scope: !0, file: !1, line: 40, type: !120, isLocal: false, isDefinition: true)
!125 = !DIGlobalVariable(name: "skyBottom.2", linkageName: "skyBottom.2", scope: !0, file: !1, line: 40, type: !122, isLocal: false, isDefinition: true)
!126 = !DIGlobalVariable(name: "skyTop.0", linkageName: "skyTop.0", scope: !0, file: !1, line: 39, type: !118, isLocal: false, isDefinition: true)
!127 = !DIGlobalVariable(name: "skyTop.1", linkageName: "skyTop.1", scope: !0, file: !1, line: 39, type: !120, isLocal: false, isDefinition: true)
!128 = !DIGlobalVariable(name: "skyTop.2", linkageName: "skyTop.2", scope: !0, file: !1, line: 39, type: !122, isLocal: false, isDefinition: true)
!129 = !{i32 2, !"Dwarf Version", i32 4}
!130 = !{i32 2, !"Debug Info Version", i32 3}
!131 = !{!"dxcoob 1.8.2505.32 (b106a961d)"}
!132 = !{!"shader.hlsl", !"struct Payload // 32 bytes\0D\0A{\0D\0A    float3 color; // 12 bytes\0D\0A    float3 throughput; // 12 bytes\0D\0A    bool allowReflection; // 4 bytes\0D\0A    bool missed; // bytes\0D\0A};\0D\0Astruct Vertex\0D\0A{\0D\0A    float3 position;\0D\0A    float3 normal;\0D\0A    float2 texcoord;\0D\0A    uint materialIndex;\0D\0A};\0D\0Astruct Material\0D\0A{\0D\0A    float3 color;\0D\0A    float roughness;\0D\0A    float metallic;\0D\0A    float ior;\0D\0A    float transmission;\0D\0A    float emission;\0D\0A};\0D\0A\0D\0A\0D\0A// UAV and SRVs\0D\0ARaytracingAccelerationStructure scene : register(t0, space0);\0D\0ARWTexture2D<float4> uav : register(u0, space0);\0D\0AStructuredBuffer<Vertex> VertexBuffers[] : register(t1, space1);\0D\0ABuffer<uint> IndexBuffers[] : register(t2, space2);\0D\0A\0D\0AStructuredBuffer<Material> Materials : register(t3, space3);\0D\0ABuffer<uint> materialIndexBuffer : register(t3, space4);\0D\0A\0D\0A\0D\0A// constants\0D\0Astatic const float3 camera = float3(0, 0, -7);\0D\0Astatic const float3 light = float3(0, 200, 0);\0D\0Astatic const float3 skyTop = float3(0.24, 0.44, 0.72);\0D\0Astatic const float3 skyBottom = float3(0.75, 0.86, 0.93);\0D\0A[shader(\22raygeneration\22)]\0D\0Avoid RayGeneration()\0D\0A{\0D\0A    \0D\0A    uint2 idx = DispatchRaysIndex().xy;\0D\0A    float2 size = DispatchRaysDimensions().xy;\0D\0A\0D\0A    float2 uv = idx / size;\0D\0A    float3 target = float3((uv.x * 2 - 1) * 1.8 * (size.x / size.y), (1 - uv.y) * 4 - 2 + camera.y, 0);\0D\0A\0D\0A    RayDesc ray;\0D\0A    ray.Origin = camera;\0D\0A    ray.Direction = target - camera;\0D\0A    ray.TMin = 0.001;\0D\0A    ray.TMax = 1000;\0D\0A    \0D\0A    Payload payload;\0D\0A    payload.allowReflection = true;\0D\0A    payload.missed = false;\0D\0A    payload.throughput = float3(1, 1, 1);\0D\0A    payload.color = float3(1, 1, 1);\0D\0A\0D\0A    TraceRay(scene, RAY_FLAG_NONE, 0xFF, 0, 0, 0, ray, payload);\0D\0A    uav[idx] = float4(payload.color, 1);\0D\0A}\0D\0A[shader(\22miss\22)]\0D\0Avoid Miss(inout Payload payload)\0D\0A{\0D\0A    float slope = normalize(WorldRayDirection()).y;\0D\0A    float t = saturate(slope * 5 + 0.5);\0D\0A    payload.color = lerp(skyBottom, skyTop, t);\0D\0A    payload.missed = true;\0D\0A}\0D\0Avoid Hit(inout Payload payload, float2 uv)\0D\0A{\0D\0A    uint instanceIndex = InstanceIndex(); // auto generated\0D\0A    uint instanceID = InstanceID(); // for vertice/index buffers\0D\0A    uint prim = PrimitiveIndex();\0D\0A\0D\0A    // Fetch triangle indices\0D\0A    uint i0 = IndexBuffers[instanceID][prim * 3 + 0];\0D\0A    uint i1 = IndexBuffers[instanceID][prim * 3 + 1];\0D\0A    uint i2 = IndexBuffers[instanceID][prim * 3 + 2];\0D\0A\0D\0A    // Fetch Vertices\0D\0A    Vertex v0 = VertexBuffers[instanceID][i0];\0D\0A    Vertex v1 = VertexBuffers[instanceID][i1];\0D\0A    Vertex v2 = VertexBuffers[instanceID][i2];\0D\0A\0D\0A    // Interpolate normal from three vertices\0D\0A    float uv0 = 1.0f - uv.x - uv.y;\0D\0A    float3 normal = normalize(v0.normal * uv0 + v1.normal * uv.x + v2.normal * uv.y);\0D\0A    float3 worldNormal = normalize(mul(normal, (float3x3) ObjectToWorld4x3()));\0D\0A\0D\0A    float3 rayPos = WorldRayOrigin() + WorldRayDirection() * RayTCurrent();\0D\0A\0D\0A    float3 wi = WorldRayDirection() * -1;\0D\0A    wi = normalize(wi);\0D\0A\0D\0A    uint matID = materialIndexBuffer[instanceIndex];\0D\0A    Material mat = Materials[matID];\0D\0A    \0D\0A    float3 throughput = dot(worldNormal, wi);\0D\0A    \0D\0A    throughput *= mat.color;    \0D\0A    payload.color *= throughput;\0D\0A    \0D\0A    \0D\0A\0D\0A}\0D\0A        \0D\0A[shader(\22closesthit\22)]\0D\0Avoid ClosestHit(inout Payload payload, BuiltInTriangleIntersectionAttributes attribs)\0D\0A{\0D\0A    float2 uv = attribs.barycentrics;\0D\0A    Hit(payload, uv);\0D\0A    return;\0D\0A    \0D\0A}"}
!133 = !{!"shader.hlsl"}
!134 = !{!"-E", !"lib.no::entry", !"-T", !"lib_6_3", !"/Fo", !"C:\5CUsers\5Chazza\5Csource\5Crepos\5CDX12PathTracer\5Cx64\5CDebug\5Cshader.cso", !"/Od", !"/Zi", !"-Qembed_debug"}
!135 = !{i32 1, i32 3}
!136 = !{i32 1, i32 9}
!137 = !{!"lib", i32 6, i32 3}
!138 = !{!139, !149, null, null}
!139 = !{!140, !142, !144, !146, !148}
!140 = !{i32 0, %struct.RaytracingAccelerationStructure* @"\01?scene@@3URaytracingAccelerationStructure@@A", !"scene", i32 0, i32 0, i32 1, i32 16, i32 0, !141}
!141 = !{i32 0, i32 4}
!142 = !{i32 1, [0 x %"class.StructuredBuffer<Vertex>"]* @"\01?VertexBuffers@@3PAV?$StructuredBuffer@UVertex@@@@A", !"VertexBuffers", i32 1, i32 1, i32 -1, i32 12, i32 0, !143}
!143 = !{i32 1, i32 36}
!144 = !{i32 2, [0 x %"class.Buffer<unsigned int>"]* @"\01?IndexBuffers@@3PAV?$Buffer@I@@A", !"IndexBuffers", i32 2, i32 2, i32 -1, i32 10, i32 0, !145}
!145 = !{i32 0, i32 5}
!146 = !{i32 3, %"class.StructuredBuffer<Material>"* @"\01?Materials@@3V?$StructuredBuffer@UMaterial@@@@A", !"Materials", i32 3, i32 3, i32 1, i32 12, i32 0, !147}
!147 = !{i32 1, i32 32}
!148 = !{i32 4, %"class.Buffer<unsigned int>"* @"\01?materialIndexBuffer@@3V?$Buffer@I@@A", !"materialIndexBuffer", i32 4, i32 3, i32 1, i32 10, i32 0, !145}
!149 = !{!150}
!150 = !{i32 0, %"class.RWTexture2D<vector<float, 4> >"* @"\01?uav@@3V?$RWTexture2D@V?$vector@M$03@@@@A", !"uav", i32 0, i32 0, i32 1, i32 2, i1 false, i1 false, i1 false, !151}
!151 = !{i32 0, i32 9}
!152 = !{i32 0, %"class.StructuredBuffer<Vertex>" undef, !153, %struct.Vertex undef, !155, %"class.StructuredBuffer<Material>" undef, !160, %struct.Material undef, !161, %struct.Payload undef, !168, %struct.BuiltInTriangleIntersectionAttributes undef, !172}
!153 = !{i32 44, !154}
!154 = !{i32 6, !"h", i32 3, i32 0}
!155 = !{i32 44, !156, !157, !158, !159}
!156 = !{i32 6, !"position", i32 3, i32 0, i32 7, i32 9}
!157 = !{i32 6, !"normal", i32 3, i32 16, i32 7, i32 9}
!158 = !{i32 6, !"texcoord", i32 3, i32 32, i32 7, i32 9}
!159 = !{i32 6, !"materialIndex", i32 3, i32 40, i32 7, i32 5}
!160 = !{i32 32, !154}
!161 = !{i32 32, !162, !163, !164, !165, !166, !167}
!162 = !{i32 6, !"color", i32 3, i32 0, i32 7, i32 9}
!163 = !{i32 6, !"roughness", i32 3, i32 12, i32 7, i32 9}
!164 = !{i32 6, !"metallic", i32 3, i32 16, i32 7, i32 9}
!165 = !{i32 6, !"ior", i32 3, i32 20, i32 7, i32 9}
!166 = !{i32 6, !"transmission", i32 3, i32 24, i32 7, i32 9}
!167 = !{i32 6, !"emission", i32 3, i32 28, i32 7, i32 9}
!168 = !{i32 36, !162, !169, !170, !171}
!169 = !{i32 6, !"throughput", i32 3, i32 16, i32 7, i32 9}
!170 = !{i32 6, !"allowReflection", i32 3, i32 28, i32 7, i32 1}
!171 = !{i32 6, !"missed", i32 3, i32 32, i32 7, i32 1}
!172 = !{i32 8, !173}
!173 = !{i32 6, !"barycentrics", i32 3, i32 0, i32 7, i32 9}
!174 = !{i32 1, void ()* @"\01?RayGeneration@@YAXXZ", !175, void (%struct.Payload*)* @"\01?Miss@@YAXUPayload@@@Z", !177, void (%struct.Payload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ClosestHit@@YAXUPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !179}
!175 = !{!176}
!176 = !{i32 1, !2, !2}
!177 = !{!176, !178}
!178 = !{i32 2, !2, !2}
!179 = !{!176, !178, !180}
!180 = !{i32 0, !2, !2}
!181 = !{null, !"", null, !138, !182}
!182 = !{i32 0, i64 17}
!183 = !{void (%struct.Payload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ClosestHit@@YAXUPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !"\01?ClosestHit@@YAXUPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", null, null, !184}
!184 = !{i32 8, i32 10, i32 6, i32 32, i32 7, i32 8, i32 5, !185}
!185 = !{i32 0}
!186 = !{void (%struct.Payload*)* @"\01?Miss@@YAXUPayload@@@Z", !"\01?Miss@@YAXUPayload@@@Z", null, null, !187}
!187 = !{i32 8, i32 11, i32 6, i32 32, i32 5, !185}
!188 = !{void ()* @"\01?RayGeneration@@YAXXZ", !"\01?RayGeneration@@YAXXZ", null, null, !189}
!189 = !{i32 8, i32 7, i32 5, !185}
!190 = !DILocation(line: 63, column: 5, scope: !40)
!191 = !DILocation(line: 64, column: 5, scope: !40)
!192 = !DILocation(line: 45, column: 17, scope: !40)
!193 = !DILocation(line: 45, column: 11, scope: !40)
!194 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "idx", scope: !40, file: !1, line: 45, type: !195)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, line: 45, baseType: !196)
!196 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 45, size: 64, align: 32, elements: !197, templateParams: !200)
!197 = !{!198, !199}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !196, file: !1, line: 45, baseType: !73, size: 32, align: 32, flags: DIFlagPublic)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !196, file: !1, line: 45, baseType: !73, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!200 = !{!98, !63}
!201 = !DIExpression(DW_OP_bit_piece, 0, 32)
!202 = !DIExpression(DW_OP_bit_piece, 32, 32)
!203 = !DILocation(line: 46, column: 19, scope: !40)
!204 = !DILocation(line: 46, column: 12, scope: !40)
!205 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !40, file: !1, line: 46, type: !57)
!206 = !DILocation(line: 48, column: 17, scope: !40)
!207 = !DILocation(line: 48, column: 21, scope: !40)
!208 = !DILocation(line: 48, column: 12, scope: !40)
!209 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "uv", scope: !40, file: !1, line: 48, type: !57)
!210 = !DILocation(line: 49, column: 34, scope: !40)
!211 = !DILocation(line: 49, column: 38, scope: !40)
!212 = !DILocation(line: 49, column: 43, scope: !40)
!213 = !DILocation(line: 49, column: 59, scope: !40)
!214 = !DILocation(line: 49, column: 49, scope: !40)
!215 = !DILocation(line: 49, column: 73, scope: !40)
!216 = !DILocation(line: 49, column: 81, scope: !40)
!217 = !DILocation(line: 49, column: 85, scope: !40)
!218 = !DILocation(line: 49, column: 91, scope: !40)
!219 = !DILocation(line: 49, column: 89, scope: !40)
!220 = !DILocation(line: 49, column: 12, scope: !40)
!221 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "target", scope: !40, file: !1, line: 49, type: !4)
!222 = !DIExpression(DW_OP_bit_piece, 64, 32)
!223 = !DILocation(line: 52, column: 18, scope: !40)
!224 = !DILocation(line: 52, column: 16, scope: !40)
!225 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ray", scope: !40, file: !1, line: 51, type: !226)
!226 = !DICompositeType(tag: DW_TAG_structure_type, name: "RayDesc", file: !1, line: 51, size: 256, align: 32, elements: !227)
!227 = !{!228, !229, !230, !231}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "Origin", scope: !226, file: !1, line: 51, baseType: !5, size: 96, align: 32)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "TMin", scope: !226, file: !1, line: 51, baseType: !8, size: 32, align: 32, offset: 96)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "Direction", scope: !226, file: !1, line: 51, baseType: !5, size: 96, align: 32, offset: 128)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "TMax", scope: !226, file: !1, line: 51, baseType: !8, size: 32, align: 32, offset: 224)
!232 = !DILocation(line: 51, column: 13, scope: !40)
!233 = !DILocation(line: 53, column: 30, scope: !40)
!234 = !DILocation(line: 53, column: 28, scope: !40)
!235 = !DILocation(line: 53, column: 19, scope: !40)
!236 = !DIExpression(DW_OP_bit_piece, 128, 32)
!237 = !DIExpression(DW_OP_bit_piece, 160, 32)
!238 = !DIExpression(DW_OP_bit_piece, 192, 32)
!239 = !DILocation(line: 54, column: 14, scope: !40)
!240 = !DIExpression(DW_OP_bit_piece, 96, 32)
!241 = !DILocation(line: 55, column: 14, scope: !40)
!242 = !DIExpression(DW_OP_bit_piece, 224, 32)
!243 = !DILocation(line: 58, column: 29, scope: !40)
!244 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "payload", scope: !40, file: !1, line: 57, type: !47)
!245 = !DILocation(line: 57, column: 13, scope: !40)
!246 = !DILocation(line: 59, column: 20, scope: !40)
!247 = !DILocation(line: 60, column: 24, scope: !40)
!248 = !DIExpression(DW_OP_bit_piece, 96, 96)
!249 = !DILocation(line: 61, column: 19, scope: !40)
!250 = !DIExpression(DW_OP_bit_piece, 0, 96)
!251 = !DILocation(line: 64, column: 31, scope: !40)
!252 = !DILocation(line: 64, column: 22, scope: !40)
!253 = !DILocation(line: 64, column: 14, scope: !40)
!254 = !DILocation(line: 65, column: 1, scope: !40)
!255 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "payload", arg: 1, scope: !43, file: !1, line: 67, type: !47)
!256 = !DILocation(line: 67, column: 25, scope: !43)
!257 = !DILocation(line: 69, column: 29, scope: !43)
!258 = !DILocation(line: 69, column: 19, scope: !43)
!259 = !DILocation(line: 69, column: 11, scope: !43)
!260 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "slope", scope: !43, file: !1, line: 69, type: !8)
!261 = !DIExpression()
!262 = !DILocation(line: 70, column: 30, scope: !43)
!263 = !DILocation(line: 70, column: 34, scope: !43)
!264 = !DILocation(line: 70, column: 15, scope: !43)
!265 = !DILocation(line: 70, column: 11, scope: !43)
!266 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "t", scope: !43, file: !1, line: 70, type: !8)
!267 = !DILocation(line: 71, column: 37, scope: !43)
!268 = !DILocation(line: 71, column: 26, scope: !43)
!269 = !DILocation(line: 71, column: 21, scope: !43)
!270 = !DILocation(line: 71, column: 19, scope: !43)
!271 = !DILocation(line: 72, column: 20, scope: !43)
!272 = !DILocation(line: 73, column: 1, scope: !43)
!273 = !DILocation(line: 100, column: 18, scope: !54, inlinedAt: !274)
!274 = distinct !DILocation(line: 116, column: 5, scope: !64)
!275 = !{!276}
!276 = distinct !{!276, !277, !"\01?Hit@@YAXUPayload@@V?$vector@M$01@@@Z: %payload"}
!277 = distinct !{!277, !"\01?Hit@@YAXUPayload@@V?$vector@M$01@@@Z"}
!278 = !DILocation(line: 101, column: 20, scope: !54, inlinedAt: !274)
!279 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "attribs", arg: 2, scope: !64, file: !1, line: 113, type: !67)
!280 = !DILocation(line: 113, column: 78, scope: !64)
!281 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "payload", arg: 1, scope: !64, file: !1, line: 113, type: !47)
!282 = !DILocation(line: 113, column: 31, scope: !64)
!283 = !DILocation(line: 115, column: 25, scope: !64)
!284 = !DILocation(line: 115, column: 12, scope: !64)
!285 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "uv", scope: !64, file: !1, line: 115, type: !57)
!286 = !DILocation(line: 116, column: 5, scope: !64)
!287 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "uv", arg: 2, scope: !54, file: !1, line: 74, type: !57)
!288 = !DILocation(line: 74, column: 40, scope: !54, inlinedAt: !274)
!289 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "payload", arg: 1, scope: !54, file: !1, line: 74, type: !47)
!290 = !DILocation(line: 74, column: 24, scope: !54, inlinedAt: !274)
!291 = !DILocation(line: 76, column: 26, scope: !54, inlinedAt: !274)
!292 = !DILocation(line: 76, column: 10, scope: !54, inlinedAt: !274)
