#if 0
; shader debug name: 043c89de38599b6a370e1d9715b94b20.pdb
; shader hash: 043c89de38599b6a370e1d9715b94b20
;
; Buffer Definitions:
;
;
; Resource Bindings:
;
; Name                                 Type  Format         Dim      ID      HLSL Bind  Count
; ------------------------------ ---------- ------- ----------- ------- -------------- ------
; scene                             texture     i32         ras      T0             t0     1
; uav                                   UAV     f32          2d      U0             u0     1
;
target datalayout = "e-m:e-p:32:32-i1:32-i8:32-i16:32-i32:32-i64:64-f16:32-f32:32-f64:64-n8:16:32:64"
target triple = "dxil-ms-dx"

%struct.RaytracingAccelerationStructure = type { i32 }
%"class.RWTexture2D<vector<float, 4> >" = type { <4 x float> }
%struct.Payload = type { <3 x float>, i32, i32 }
%dx.types.Handle = type { i8* }
%struct.BuiltInTriangleIntersectionAttributes = type { <2 x float> }

@"\01?scene@@3URaytracingAccelerationStructure@@A" = external constant %struct.RaytracingAccelerationStructure, align 4
@"\01?uav@@3V?$RWTexture2D@V?$vector@M$03@@@@A" = external constant %"class.RWTexture2D<vector<float, 4> >", align 4
@dx.nothing.a = internal constant [1 x i32] zeroinitializer

; Function Attrs: nounwind
define void @"\01?RayGeneration@@YAXXZ"() #0 {
  %1 = load %struct.RaytracingAccelerationStructure, %struct.RaytracingAccelerationStructure* @"\01?scene@@3URaytracingAccelerationStructure@@A", !dbg !149 ; line:39 col:5

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxcoob 1.8.2505.32 (b106a961d)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !48, globals: !81)
!1 = !DIFile(filename: "shader.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !15, !24, !33}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 27, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 27, size: 96, align: 32, elements: !6, templateParams: !11)
!6 = !{!7, !9, !10}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 27, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 27, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 27, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !{!12, !13}
!12 = !DITemplateTypeParameter(name: "element", type: !8)
!13 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 3)
!14 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 41, baseType: !16)
!16 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 41, size: 128, align: 32, elements: !17, templateParams: !22)
!17 = !{!18, !19, !20, !21}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !16, file: !1, line: 41, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !16, file: !1, line: 41, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !16, file: !1, line: 41, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !16, file: !1, line: 41, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!22 = !{!12, !23}
!23 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 4)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, line: 57, baseType: !25)
!25 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, line: 57, size: 96, align: 32, elements: !26, templateParams: !31)
!26 = !{!27, !29, !30}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !25, file: !1, line: 57, baseType: !28, size: 32, align: 32, flags: DIFlagPublic)
!28 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !25, file: !1, line: 57, baseType: !28, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !25, file: !1, line: 57, baseType: !28, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!31 = !{!32, !13}
!32 = !DITemplateTypeParameter(name: "element", type: !28)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3x3", file: !1, line: 58, baseType: !34)
!34 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 3, 3>", file: !1, line: 58, size: 288, align: 32, elements: !35, templateParams: !45)
!35 = !{!36, !37, !38, !39, !40, !41, !42, !43, !44}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !34, file: !1, line: 58, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !34, file: !1, line: 58, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !34, file: !1, line: 58, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !34, file: !1, line: 58, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !34, file: !1, line: 58, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !34, file: !1, line: 58, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !34, file: !1, line: 58, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !34, file: !1, line: 58, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !34, file: !1, line: 58, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!45 = !{!12, !46, !47}
!46 = !DITemplateValueParameter(name: "row_count", type: !14, value: i32 3)
!47 = !DITemplateValueParameter(name: "col_count", type: !14, value: i32 3)
!48 = !{!49, !52, !62, !72, !73, !74, !75}
!49 = !DISubprogram(name: "RayGeneration", linkageName: "\01?RayGeneration@@YAXXZ", scope: !1, file: !1, line: 20, type: !50, isLocal: false, isDefinition: true, scopeLine: 21, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @"\01?RayGeneration@@YAXXZ")
!50 = !DISubroutineType(types: !51)
!51 = !{null}
!52 = !DISubprogram(name: "Miss", linkageName: "\01?Miss@@YAXUPayload@@@Z", scope: !1, file: !1, line: 45, type: !53, isLocal: false, isDefinition: true, scopeLine: 46, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.Payload*)* @"\01?Miss@@YAXUPayload@@@Z")
!53 = !DISubroutineType(types: !54)
!54 = !{null, !55}
!55 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !56)
!56 = !DICompositeType(tag: DW_TAG_structure_type, name: "Payload", file: !1, line: 1, size: 160, align: 32, elements: !57)
!57 = !{!58, !59, !61}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !56, file: !1, line: 3, baseType: !4, size: 96, align: 32)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "allowReflection", scope: !56, file: !1, line: 4, baseType: !60, size: 32, align: 32, offset: 96)
!60 = !DIBasicType(name: "bool", size: 32, align: 32, encoding: DW_ATE_boolean)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "missed", scope: !56, file: !1, line: 5, baseType: !60, size: 32, align: 32, offset: 128)
!62 = !DISubprogram(name: "HitCube", linkageName: "\01?HitCube@@YAXUPayload@@V?$vector@M$01@@@Z", scope: !1, file: !1, line: 53, type: !63, isLocal: false, isDefinition: true, scopeLine: 54, flags: DIFlagPrototyped, isOptimized: false)
!63 = !DISubroutineType(types: !64)
!64 = !{null, !55, !65}
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 24, baseType: !66)
!66 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 24, size: 64, align: 32, elements: !67, templateParams: !70)
!67 = !{!68, !69}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !66, file: !1, line: 24, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !66, file: !1, line: 24, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!70 = !{!12, !71}
!71 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 2)
!72 = !DISubprogram(name: "HitMirror", linkageName: "\01?HitMirror@@YAXUPayload@@V?$vector@M$01@@@Z", scope: !1, file: !1, line: 70, type: !63, isLocal: false, isDefinition: true, scopeLine: 71, flags: DIFlagPrototyped, isOptimized: false)
!73 = !DISubprogram(name: "HitFloor", linkageName: "\01?HitFloor@@YAXUPayload@@V?$vector@M$01@@@Z", scope: !1, file: !1, line: 91, type: !63, isLocal: false, isDefinition: true, scopeLine: 92, flags: DIFlagPrototyped, isOptimized: false)
!74 = !DISubprogram(name: "Hit", linkageName: "\01?Hit@@YAXUPayload@@V?$vector@M$01@@@Z", scope: !1, file: !1, line: 116, type: !63, isLocal: false, isDefinition: true, scopeLine: 117, flags: DIFlagPrototyped, isOptimized: false)
!75 = !DISubprogram(name: "ClosestHit", linkageName: "\01?ClosestHit@@YAXUPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !1, file: !1, line: 138, type: !76, isLocal: false, isDefinition: true, scopeLine: 139, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.Payload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ClosestHit@@YAXUPayload@@UBuiltInTriangleIntersectionAttributes@@@Z")
!76 = !DISubroutineType(types: !77)
!77 = !{null, !55, !78}
!78 = !DICompositeType(tag: DW_TAG_structure_type, name: "BuiltInTriangleIntersectionAttributes", file: !1, line: 135, size: 64, align: 32, elements: !79)
!79 = !{!80}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "barycentrics", scope: !78, file: !1, line: 135, baseType: !66, size: 64, align: 32)
!81 = !{!82, !84, !86, !90, !92, !93, !94, !95, !97, !99, !101, !102, !103, !104, !105, !106, !107, !108, !109}
!82 = !DIGlobalVariable(name: "RAY_FLAG_NONE", scope: !0, file: !1, line: 39, type: !83, isLocal: true, isDefinition: true, variable: i32 0)
!83 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !28)
!84 = !DIGlobalVariable(name: "scene", linkageName: "\01?scene@@3URaytracingAccelerationStructure@@A", scope: !0, file: !1, line: 9, type: !85, isLocal: false, isDefinition: true, variable: %struct.RaytracingAccelerationStructure* @"\01?scene@@3URaytracingAccelerationStructure@@A")
!85 = !DICompositeType(tag: DW_TAG_structure_type, name: "RaytracingAccelerationStructure", file: !1, line: 9, size: 32, align: 32, elements: !2)
!86 = !DIGlobalVariable(name: "uav", linkageName: "\01?uav@@3V?$RWTexture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 11, type: !87, isLocal: false, isDefinition: true, variable: %"class.RWTexture2D<vector<float, 4> >"* @"\01?uav@@3V?$RWTexture2D@V?$vector@M$03@@@@A")
!87 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<vector<float, 4> >", file: !1, line: 11, size: 128, align: 32, elements: !2, templateParams: !88)
!88 = !{!89}
!89 = !DITemplateTypeParameter(name: "element", type: !16)
!90 = !DIGlobalVariable(name: "camera", scope: !0, file: !1, line: 14, type: !91, isLocal: true, isDefinition: true)
!91 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!92 = !DIGlobalVariable(name: "light", scope: !0, file: !1, line: 15, type: !91, isLocal: true, isDefinition: true)
!93 = !DIGlobalVariable(name: "skyTop", scope: !0, file: !1, line: 16, type: !91, isLocal: true, isDefinition: true)
!94 = !DIGlobalVariable(name: "skyBottom", scope: !0, file: !1, line: 17, type: !91, isLocal: true, isDefinition: true)
!95 = !DIGlobalVariable(name: "camera.0", linkageName: "camera.0", scope: !0, file: !1, line: 14, type: !96, isLocal: false, isDefinition: true)
!96 = !DIDerivedType(tag: DW_TAG_member, name: ".0", baseType: !91, size: 32, align: 4)
!97 = !DIGlobalVariable(name: "camera.1", linkageName: "camera.1", scope: !0, file: !1, line: 14, type: !98, isLocal: false, isDefinition: true)
!98 = !DIDerivedType(tag: DW_TAG_member, name: ".1", baseType: !91, size: 32, align: 4, offset: 32)
!99 = !DIGlobalVariable(name: "camera.2", linkageName: "camera.2", scope: !0, file: !1, line: 14, type: !100, isLocal: false, isDefinition: true)
!100 = !DIDerivedType(tag: DW_TAG_member, name: ".2", baseType: !91, size: 32, align: 4, offset: 64)
!101 = !DIGlobalVariable(name: "light.0", linkageName: "light.0", scope: !0, file: !1, line: 15, type: !96, isLocal: false, isDefinition: true)
!102 = !DIGlobalVariable(name: "light.1", linkageName: "light.1", scope: !0, file: !1, line: 15, type: !98, isLocal: false, isDefinition: true)
!103 = !DIGlobalVariable(name: "light.2", linkageName: "light.2", scope: !0, file: !1, line: 15, type: !100, isLocal: false, isDefinition: true)
!104 = !DIGlobalVariable(name: "skyBottom.0", linkageName: "skyBottom.0", scope: !0, file: !1, line: 17, type: !96, isLocal: false, isDefinition: true)
!105 = !DIGlobalVariable(name: "skyBottom.1", linkageName: "skyBottom.1", scope: !0, file: !1, line: 17, type: !98, isLocal: false, isDefinition: true)
!106 = !DIGlobalVariable(name: "skyBottom.2", linkageName: "skyBottom.2", scope: !0, file: !1, line: 17, type: !100, isLocal: false, isDefinition: true)
!107 = !DIGlobalVariable(name: "skyTop.0", linkageName: "skyTop.0", scope: !0, file: !1, line: 16, type: !96, isLocal: false, isDefinition: true)
!108 = !DIGlobalVariable(name: "skyTop.1", linkageName: "skyTop.1", scope: !0, file: !1, line: 16, type: !98, isLocal: false, isDefinition: true)
!109 = !DIGlobalVariable(name: "skyTop.2", linkageName: "skyTop.2", scope: !0, file: !1, line: 16, type: !100, isLocal: false, isDefinition: true)
!110 = !{i32 2, !"Dwarf Version", i32 4}
!111 = !{i32 2, !"Debug Info Version", i32 3}
!112 = !{!"dxcoob 1.8.2505.32 (b106a961d)"}
!113 = !{!"shader.hlsl", !"struct Payload\0D\0A{\0D\0A    float3 color;\0D\0A    bool allowReflection;\0D\0A    bool missed;\0D\0A    \0D\0A};\0D\0A\0D\0ARaytracingAccelerationStructure scene : register(t0);\0D\0A\0D\0ARWTexture2D<float4> uav : register(u0);\0D\0A\0D\0A// constants\0D\0Astatic const float3 camera = float3(0, 1.5, -7);\0D\0Astatic const float3 light = float3(0, 200, 0);\0D\0Astatic const float3 skyTop = float3(0.24, 0.44, 0.72);\0D\0Astatic const float3 skyBottom = float3(0.75, 0.86, 0.93);\0D\0A\0D\0A[shader(\22raygeneration\22)]\0D\0Avoid RayGeneration()\0D\0A{\0D\0A    \0D\0A    uint2 idx = DispatchRaysIndex().xy;\0D\0A    float2 size = DispatchRaysDimensions().xy;\0D\0A    \0D\0A    float2 uv = idx / size;\0D\0A    float3 target = float3((uv.x * 2 - 1) * 1.8 * (size.x / size.y), (1 - uv.y) * 4 - 2 + camera.y, 0);\0D\0A    \0D\0A    RayDesc ray;\0D\0A    ray.Origin = camera;\0D\0A    ray.Direction = target - camera;\0D\0A    ray.TMin = 0.001;\0D\0A    ray.TMax = 1000;\0D\0A    \0D\0A    Payload payload;\0D\0A    payload.allowReflection = true;\0D\0A    payload.missed = false;\0D\0A    \0D\0A    TraceRay(scene, RAY_FLAG_NONE, 0xFF, 0, 0, 0, ray, payload);\0D\0A\0D\0A    uav[idx] = float4(payload.color, 1);\0D\0A}\0D\0A\0D\0A[shader(\22miss\22)]\0D\0Avoid Miss(inout Payload payload)\0D\0A{\0D\0A    float slope = normalize(WorldRayDirection()).y;\0D\0A    float t = saturate(slope * 5 + 0.5);\0D\0A    payload.color = lerp(skyBottom, skyTop, t);\0D\0A    payload.missed = true;\0D\0A}\0D\0A\0D\0Avoid HitCube(inout Payload payload, float2 uv)\0D\0A{\0D\0A    uint tri = PrimitiveIndex();\0D\0A    tri /= 2;\0D\0A    float3 normal = (tri.xxx % 3 == uint3(0, 1, 2)) * (tri < 3 ? -1 : 1);\0D\0A    float3 worldNormal = normalize(mul(normal, (float3x3) ObjectToWorld4x3()));\0D\0A    \0D\0A    float3 color = abs(normal) / 3 + 0.5;\0D\0A    if (uv.x < 0.03 || uv.y < 0.03)\0D\0A        color = 0.25.rrr;\0D\0A    \0D\0A    color *= saturate(dot(worldNormal, normalize(light))) + 0.33;\0D\0A    payload.color = color;\0D\0A\0D\0A}\0D\0A\0D\0A\0D\0Avoid HitMirror(inout Payload payload, float2 uv)\0D\0A{\0D\0A    \0D\0A    if (!payload.allowReflection)\0D\0A        return;\0D\0A    \0D\0A    float3 pos = WorldRayOrigin() + WorldRayDirection() * RayTCurrent();\0D\0A    float3 normal = normalize(mul(float3(0, 1, 0), (float3x3) ObjectToWorld4x3()));\0D\0A    float3 reflected = reflect(normalize(WorldRayDirection()), normal);\0D\0A    \0D\0A    RayDesc mirrorRay;\0D\0A    mirrorRay.Origin = pos;\0D\0A    mirrorRay.Direction = reflected;\0D\0A    mirrorRay.TMin = 0.001;\0D\0A    mirrorRay.TMax = 1000;\0D\0A    \0D\0A    payload.allowReflection = false;\0D\0A    TraceRay(scene, RAY_FLAG_NONE, 0xFF, 0, 0, 0, mirrorRay, payload);\0D\0A}\0D\0A\0D\0A\0D\0Avoid HitFloor(inout Payload payload, float2 uv)\0D\0A{\0D\0A    float3 pos = WorldRayOrigin() + WorldRayDirection() * RayTCurrent();\0D\0A    \0D\0A    bool2 pattern = frac(pos.xz) > 0.5;\0D\0A    payload.color = (pattern.x ^ pattern.y ? 0.6 : 0.4).rrr;\0D\0A    \0D\0A    RayDesc shadowRay;\0D\0A    shadowRay.Origin = pos;\0D\0A    shadowRay.Direction = light - pos;\0D\0A    shadowRay.TMin = 0.001;\0D\0A    shadowRay.TMax = 1;\0D\0A    \0D\0A    Payload shadow;\0D\0A    shadow.allowReflection = false;\0D\0A    shadow.missed = false;\0D\0A    TraceRay(scene, RAY_FLAG_NONE, 0xFF, 0, 0, 0, shadowRay, shadow);\0D\0A    \0D\0A    if (!shadow.missed)\0D\0A    {\0D\0A        payload.color /= 2;\0D\0A    }\0D\0A\0D\0A}\0D\0A\0D\0Avoid Hit(inout Payload payload, float2 uv)\0D\0A{\0D\0A    \0D\0A    uint tri = PrimitiveIndex();\0D\0A    \0D\0A    tri /= 2;\0D\0A    float3 normal = (tri.xxx % 3 == uint3(0, 1, 2)) * (tri < 3 ? -1 : 1);\0D\0A    \0D\0A    float3 worldNormal = normalize(mul(normal, (float3x3) ObjectToWorld4x3()));\0D\0A    \0D\0A    float3 color = abs(normal) / 3 + 0.5;\0D\0A    if (uv.x < 0.03 || uv.y < 0.03)\0D\0A        color = 0.25.rrr;\0D\0A    \0D\0A    color *= saturate(dot(worldNormal, normalize(light))) + 0.33;\0D\0A    payload.color = color;\0D\0A    \0D\0A    //payload.color = (0.5, 0.5, 0.5);\0D\0A    \0D\0A}\0D\0A\0D\0A[shader(\22closesthit\22)]\0D\0Avoid ClosestHit(inout Payload payload, BuiltInTriangleIntersectionAttributes attribs)\0D\0A{\0D\0A    float2 uv = attribs.barycentrics;\0D\0A    Hit(payload, uv);\0D\0A    return;\0D\0A    \0D\0A    switch (InstanceID())\0D\0A    {\0D\0A        case 0:\0D\0A            HitCube(payload, uv);\0D\0A            break;\0D\0A        \0D\0A        case 1:\0D\0A            HitMirror(payload, uv);\0D\0A            break;\0D\0A        \0D\0A        case 2:\0D\0A            HitFloor(payload, uv);\0D\0A            break;\0D\0A        \0D\0A        default:\0D\0A            payload.color = float3(1, 0, 1);\0D\0A            break;\0D\0A        \0D\0A    }\0D\0A\0D\0A}"}
!114 = !{!"shader.hlsl"}
!115 = !{!"-E", !"lib.no::entry", !"-T", !"lib_6_3", !"/Fo", !"C:\5CUsers\5Chazza\5Csource\5Crepos\5CDX12PathTracer\5Cx64\5CDebug\5Cshader.cso", !"/Od", !"/Zi", !"-Qembed_debug"}
!116 = !{i32 1, i32 3}
!117 = !{i32 1, i32 9}
!118 = !{!"lib", i32 6, i32 3}
!119 = !{!120, !123, null, null}
!120 = !{!121}
!121 = !{i32 0, %struct.RaytracingAccelerationStructure* @"\01?scene@@3URaytracingAccelerationStructure@@A", !"scene", i32 0, i32 0, i32 1, i32 16, i32 0, !122}
!122 = !{i32 0, i32 4}
!123 = !{!124}
!124 = !{i32 0, %"class.RWTexture2D<vector<float, 4> >"* @"\01?uav@@3V?$RWTexture2D@V?$vector@M$03@@@@A", !"uav", i32 0, i32 0, i32 1, i32 2, i1 false, i1 false, i1 false, !125}
!125 = !{i32 0, i32 9}
!126 = !{i32 0, %struct.Payload undef, !127, %struct.BuiltInTriangleIntersectionAttributes undef, !131}
!127 = !{i32 20, !128, !129, !130}
!128 = !{i32 6, !"color", i32 3, i32 0, i32 7, i32 9}
!129 = !{i32 6, !"allowReflection", i32 3, i32 12, i32 7, i32 1}
!130 = !{i32 6, !"missed", i32 3, i32 16, i32 7, i32 1}
!131 = !{i32 8, !132}
!132 = !{i32 6, !"barycentrics", i32 3, i32 0, i32 7, i32 9}
!133 = !{i32 1, void ()* @"\01?RayGeneration@@YAXXZ", !134, void (%struct.Payload*)* @"\01?Miss@@YAXUPayload@@@Z", !136, void (%struct.Payload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ClosestHit@@YAXUPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !138}
!134 = !{!135}
!135 = !{i32 1, !2, !2}
!136 = !{!135, !137}
!137 = !{i32 2, !2, !2}
!138 = !{!135, !137, !139}
!139 = !{i32 0, !2, !2}
!140 = !{null, !"", null, !119, !141}
!141 = !{i32 0, i64 1}
!142 = !{void (%struct.Payload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ClosestHit@@YAXUPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !"\01?ClosestHit@@YAXUPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", null, null, !143}
!143 = !{i32 8, i32 10, i32 6, i32 20, i32 7, i32 8, i32 5, !144}
!144 = !{i32 0}
!145 = !{void (%struct.Payload*)* @"\01?Miss@@YAXUPayload@@@Z", !"\01?Miss@@YAXUPayload@@@Z", null, null, !146}
!146 = !{i32 8, i32 11, i32 6, i32 20, i32 5, !144}
!147 = !{void ()* @"\01?RayGeneration@@YAXXZ", !"\01?RayGeneration@@YAXXZ", null, null, !148}
!148 = !{i32 8, i32 7, i32 5, !144}
!149 = !DILocation(line: 39, column: 5, scope: !49)
!150 = !DILocation(line: 41, column: 5, scope: !49)
!151 = !DILocation(line: 23, column: 17, scope: !49)
!152 = !DILocation(line: 23, column: 11, scope: !49)
!153 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "idx", scope: !49, file: !1, line: 23, type: !154)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, line: 23, baseType: !155)
!155 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 23, size: 64, align: 32, elements: !156, templateParams: !159)
!156 = !{!157, !158}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !155, file: !1, line: 23, baseType: !28, size: 32, align: 32, flags: DIFlagPublic)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !155, file: !1, line: 23, baseType: !28, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!159 = !{!32, !71}
!160 = !DIExpression(DW_OP_bit_piece, 0, 32)
!161 = !DIExpression(DW_OP_bit_piece, 32, 32)
!162 = !DILocation(line: 24, column: 19, scope: !49)
!163 = !DILocation(line: 24, column: 12, scope: !49)
!164 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !49, file: !1, line: 24, type: !65)
!165 = !DILocation(line: 26, column: 17, scope: !49)
!166 = !DILocation(line: 26, column: 21, scope: !49)
!167 = !DILocation(line: 26, column: 12, scope: !49)
!168 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "uv", scope: !49, file: !1, line: 26, type: !65)
!169 = !DILocation(line: 27, column: 34, scope: !49)
!170 = !DILocation(line: 27, column: 38, scope: !49)
!171 = !DILocation(line: 27, column: 43, scope: !49)
!172 = !DILocation(line: 27, column: 59, scope: !49)
!173 = !DILocation(line: 27, column: 49, scope: !49)
!174 = !DILocation(line: 27, column: 73, scope: !49)
!175 = !DILocation(line: 27, column: 81, scope: !49)
!176 = !DILocation(line: 27, column: 85, scope: !49)
!177 = !DILocation(line: 27, column: 91, scope: !49)
!178 = !DILocation(line: 27, column: 89, scope: !49)
!179 = !DILocation(line: 27, column: 12, scope: !49)
!180 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "target", scope: !49, file: !1, line: 27, type: !4)
!181 = !DIExpression(DW_OP_bit_piece, 64, 32)
!182 = !DILocation(line: 30, column: 18, scope: !49)
!183 = !DILocation(line: 30, column: 16, scope: !49)
!184 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ray", scope: !49, file: !1, line: 29, type: !185)
!185 = !DICompositeType(tag: DW_TAG_structure_type, name: "RayDesc", file: !1, line: 29, size: 256, align: 32, elements: !186)
!186 = !{!187, !188, !189, !190}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "Origin", scope: !185, file: !1, line: 29, baseType: !5, size: 96, align: 32)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "TMin", scope: !185, file: !1, line: 29, baseType: !8, size: 32, align: 32, offset: 96)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "Direction", scope: !185, file: !1, line: 29, baseType: !5, size: 96, align: 32, offset: 128)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "TMax", scope: !185, file: !1, line: 29, baseType: !8, size: 32, align: 32, offset: 224)
!191 = !DILocation(line: 29, column: 13, scope: !49)
!192 = !DILocation(line: 31, column: 30, scope: !49)
!193 = !DILocation(line: 31, column: 28, scope: !49)
!194 = !DILocation(line: 31, column: 19, scope: !49)
!195 = !DIExpression(DW_OP_bit_piece, 128, 32)
!196 = !DIExpression(DW_OP_bit_piece, 160, 32)
!197 = !DIExpression(DW_OP_bit_piece, 192, 32)
!198 = !DILocation(line: 32, column: 14, scope: !49)
!199 = !DIExpression(DW_OP_bit_piece, 96, 32)
!200 = !DILocation(line: 33, column: 14, scope: !49)
!201 = !DIExpression(DW_OP_bit_piece, 224, 32)
!202 = !DILocation(line: 36, column: 29, scope: !49)
!203 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "payload", scope: !49, file: !1, line: 35, type: !56)
!204 = !DILocation(line: 35, column: 13, scope: !49)
!205 = !DILocation(line: 37, column: 20, scope: !49)
!206 = !DILocation(line: 41, column: 31, scope: !49)
!207 = !DIExpression(DW_OP_bit_piece, 0, 96)
!208 = !DILocation(line: 41, column: 22, scope: !49)
!209 = !DILocation(line: 41, column: 14, scope: !49)
!210 = !DILocation(line: 42, column: 1, scope: !49)
!211 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "payload", arg: 1, scope: !52, file: !1, line: 45, type: !56)
!212 = !DILocation(line: 45, column: 25, scope: !52)
!213 = !DILocation(line: 47, column: 29, scope: !52)
!214 = !DILocation(line: 47, column: 19, scope: !52)
!215 = !DILocation(line: 47, column: 11, scope: !52)
!216 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "slope", scope: !52, file: !1, line: 47, type: !8)
!217 = !DIExpression()
!218 = !DILocation(line: 48, column: 30, scope: !52)
!219 = !DILocation(line: 48, column: 34, scope: !52)
!220 = !DILocation(line: 48, column: 15, scope: !52)
!221 = !DILocation(line: 48, column: 11, scope: !52)
!222 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "t", scope: !52, file: !1, line: 48, type: !8)
!223 = !DILocation(line: 49, column: 37, scope: !52)
!224 = !DILocation(line: 49, column: 26, scope: !52)
!225 = !DILocation(line: 49, column: 21, scope: !52)
!226 = !DILocation(line: 49, column: 19, scope: !52)
!227 = !DILocation(line: 50, column: 20, scope: !52)
!228 = !DILocation(line: 51, column: 1, scope: !52)
!229 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "payload", arg: 1, scope: !75, file: !1, line: 138, type: !56)
!230 = !DILocation(line: 138, column: 31, scope: !75)
!231 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "attribs", arg: 2, scope: !75, file: !1, line: 138, type: !78)
!232 = !DILocation(line: 138, column: 78, scope: !75)
!233 = !DILocation(line: 140, column: 25, scope: !75)
!234 = !DILocation(line: 140, column: 12, scope: !75)
!235 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "uv", scope: !75, file: !1, line: 140, type: !65)
!236 = !DILocation(line: 141, column: 5, scope: !75)
!237 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "uv", arg: 2, scope: !74, file: !1, line: 116, type: !65)
!238 = !DILocation(line: 116, column: 40, scope: !74, inlinedAt: !239)
!239 = distinct !DILocation(line: 141, column: 5, scope: !75)
!240 = !DILocation(line: 119, column: 16, scope: !74, inlinedAt: !239)
!241 = !DILocation(line: 119, column: 10, scope: !74, inlinedAt: !239)
!242 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tri", scope: !74, file: !1, line: 119, type: !243)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 55, baseType: !28)
!244 = !DILocation(line: 121, column: 9, scope: !74, inlinedAt: !239)
!245 = !DILocation(line: 122, column: 22, scope: !74, inlinedAt: !239)
!246 = !DILocation(line: 122, column: 30, scope: !74, inlinedAt: !239)
!247 = !DILocation(line: 122, column: 34, scope: !74, inlinedAt: !239)
!248 = !DILocation(line: 122, column: 21, scope: !74, inlinedAt: !239)
!249 = !DILocation(line: 122, column: 60, scope: !74, inlinedAt: !239)
!250 = !DILocation(line: 122, column: 55, scope: !74, inlinedAt: !239)
