#if 0
;
; Note: shader requires additional functionality:
;       Typed UAV Load Additional Formats
;
; shader debug name: dce1dde164ca0cd3887da489ffed7b5b.pdb
; shader hash: dce1dde164ca0cd3887da489ffed7b5b
;
; Buffer Definitions:
;
; cbuffer Camerab
; {
;
;   struct hostlayout.Camerab
;   {
;
;       float3 camPos;                                ; Offset:    0
;       float pad0;                                   ; Offset:   12
;       row_major float4x4 InvVieProj;                ; Offset:   16
;       float pad1;                                   ; Offset:   80
;   
;   } Camerab;                                        ; Offset:    0 Size:    84
;
; }
;
; Resource bind info for VertexBuffers
; {
;
;   struct struct.Vertex
;   {
;
;       float3 position;                              ; Offset:    0
;       float3 normal;                                ; Offset:   12
;       float2 texcoord;                              ; Offset:   24
;       uint materialIndex;                           ; Offset:   32
;   
;   } $Element;                                       ; Offset:    0 Size:    36
;
; }
;
; Resource bind info for Materials
; {
;
;   struct struct.Material
;   {
;
;       float3 color;                                 ; Offset:    0
;       float roughness;                              ; Offset:   12
;       float metallic;                               ; Offset:   16
;       float ior;                                    ; Offset:   20

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxcoob 1.8.2502.11 (239921522)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !46, globals: !103)
!1 = !DIFile(filename: "raytracingshader.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !14, !23, !31}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 62, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 62, size: 64, align: 32, elements: !6, templateParams: !10)
!6 = !{!7, !9}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 62, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 62, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !{!11, !12}
!11 = !DITemplateTypeParameter(name: "element", type: !8)
!12 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 2)
!13 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 69, baseType: !15)
!15 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 69, size: 128, align: 32, elements: !16, templateParams: !21)
!16 = !{!17, !18, !19, !20}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !15, file: !1, line: 69, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !15, file: !1, line: 69, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !15, file: !1, line: 69, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !15, file: !1, line: 69, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!21 = !{!11, !22}
!22 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 4)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 44, baseType: !24)
!24 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 44, size: 96, align: 32, elements: !25, templateParams: !29)
!25 = !{!26, !27, !28}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !24, file: !1, line: 44, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !24, file: !1, line: 44, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !24, file: !1, line: 44, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!29 = !{!11, !30}
!30 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 3)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3x3", file: !1, line: 164, baseType: !32)
!32 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 3, 3>", file: !1, line: 164, size: 288, align: 32, elements: !33, templateParams: !43)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !32, file: !1, line: 164, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !32, file: !1, line: 164, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !32, file: !1, line: 164, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !32, file: !1, line: 164, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !32, file: !1, line: 164, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !32, file: !1, line: 164, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !32, file: !1, line: 164, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !32, file: !1, line: 164, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !32, file: !1, line: 164, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!43 = !{!11, !44, !45}
!44 = !DITemplateValueParameter(name: "row_count", type: !13, value: i32 3)
!45 = !DITemplateValueParameter(name: "col_count", type: !13, value: i32 3)
!46 = !{!47, !50, !57, !87, !88, !91, !97, !100}
!47 = !DISubprogram(name: "RayGeneration", linkageName: "\01?RayGeneration@@YAXXZ", scope: !1, file: !1, line: 56, type: !48, isLocal: false, isDefinition: true, scopeLine: 57, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @"\01?RayGeneration@@YAXXZ")
!48 = !DISubroutineType(types: !49)
!49 = !{null}
!50 = !DISubprogram(name: "random", linkageName: "\01?random@@YAMAIAI@Z", scope: !1, file: !1, line: 108, type: !51, isLocal: false, isDefinition: true, scopeLine: 109, flags: DIFlagPrototyped, isOptimized: false)
!51 = !DISubroutineType(types: !52)
!52 = !{!8, !53}
!53 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !54)
!54 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !55)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 78, baseType: !56)
!56 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!57 = !DISubprogram(name: "DirectionSampler", linkageName: "\01?DirectionSampler@@YA?AV?$vector@M$02@@UPayload@@UMaterial@@V1@V?$vector@M$01@@@Z", scope: !1, file: !1, line: 116, type: !58, isLocal: false, isDefinition: true, scopeLine: 117, flags: DIFlagPrototyped, isOptimized: false)
!58 = !DISubroutineType(types: !59)
!59 = !{!23, !60, !79, !23, !4}
!60 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !61)
!61 = !DICompositeType(tag: DW_TAG_structure_type, name: "Payload", file: !1, line: 1, size: 576, align: 32, elements: !62)
!62 = !{!63, !64, !65, !66, !67, !68, !70, !78}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "throughput", scope: !61, file: !1, line: 3, baseType: !23, size: 96, align: 32)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !61, file: !1, line: 4, baseType: !23, size: 96, align: 32, offset: 96)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !61, file: !1, line: 5, baseType: !23, size: 96, align: 32, offset: 192)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !61, file: !1, line: 6, baseType: !23, size: 96, align: 32, offset: 288)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "numBounces", scope: !61, file: !1, line: 7, baseType: !55, size: 32, align: 32, offset: 384)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "missed", scope: !61, file: !1, line: 8, baseType: !69, size: 32, align: 32, offset: 416)
!69 = !DIBasicType(name: "bool", size: 32, align: 32, encoding: DW_ATE_boolean)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "pixelIndex", scope: !61, file: !1, line: 9, baseType: !71, size: 64, align: 32, offset: 448)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, line: 59, baseType: !72)
!72 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 59, size: 64, align: 32, elements: !73, templateParams: !76)
!73 = !{!74, !75}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !72, file: !1, line: 59, baseType: !56, size: 32, align: 32, flags: DIFlagPublic)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !72, file: !1, line: 59, baseType: !56, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!76 = !{!77, !12}
!77 = !DITemplateTypeParameter(name: "element", type: !56)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "dims", scope: !61, file: !1, line: 10, baseType: !71, size: 64, align: 32, offset: 512)
!79 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !1, line: 20, size: 256, align: 32, elements: !80)
!80 = !{!81, !82, !83, !84, !85, !86}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !79, file: !1, line: 22, baseType: !23, size: 96, align: 32)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "roughness", scope: !79, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 96)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "metallic", scope: !79, file: !1, line: 24, baseType: !8, size: 32, align: 32, offset: 128)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "ior", scope: !79, file: !1, line: 25, baseType: !8, size: 32, align: 32, offset: 160)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "transmission", scope: !79, file: !1, line: 26, baseType: !8, size: 32, align: 32, offset: 192)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "emission", scope: !79, file: !1, line: 27, baseType: !8, size: 32, align: 32, offset: 224)
!87 = !DISubprogram(name: "throughputUpdate", linkageName: "\01?throughputUpdate@@YA?AV?$vector@M$02@@UPayload@@UMaterial@@V1@V?$vector@M$01@@@Z", scope: !1, file: !1, line: 130, type: !58, isLocal: false, isDefinition: true, scopeLine: 131, flags: DIFlagPrototyped, isOptimized: false)
!88 = !DISubprogram(name: "Hit", linkageName: "\01?Hit@@YAXUPayload@@V?$vector@M$01@@@Z", scope: !1, file: !1, line: 145, type: !89, isLocal: false, isDefinition: true, scopeLine: 146, flags: DIFlagPrototyped, isOptimized: false)
!89 = !DISubroutineType(types: !90)
!90 = !{null, !60, !4}
!91 = !DISubprogram(name: "ClosestHit", linkageName: "\01?ClosestHit@@YAXUPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !1, file: !1, line: 183, type: !92, isLocal: false, isDefinition: true, scopeLine: 184, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.Payload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ClosestHit@@YAXUPayload@@UBuiltInTriangleIntersectionAttributes@@@Z")
!92 = !DISubroutineType(types: !93)
!93 = !{null, !60, !94}
!94 = !DICompositeType(tag: DW_TAG_structure_type, name: "BuiltInTriangleIntersectionAttributes", file: !1, line: 180, size: 64, align: 32, elements: !95)
!95 = !{!96}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "barycentrics", scope: !94, file: !1, line: 180, baseType: !5, size: 64, align: 32)
!97 = !DISubprogram(name: "SampleHemisphere", linkageName: "\01?SampleHemisphere@@YA?AV?$vector@M$02@@V?$vector@M$01@@@Z", scope: !1, file: !1, line: 192, type: !98, isLocal: false, isDefinition: true, scopeLine: 193, flags: DIFlagPrototyped, isOptimized: false)
!98 = !DISubroutineType(types: !99)
!99 = !{!23, !4}
!100 = !DISubprogram(name: "Miss", linkageName: "\01?Miss@@YAXUPayload@@@Z", scope: !1, file: !1, line: 201, type: !101, isLocal: false, isDefinition: true, scopeLine: 202, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.Payload*)* @"\01?Miss@@YAXUPayload@@@Z")
!101 = !DISubroutineType(types: !102)
!102 = !{null, !60}
!103 = !{!104, !106, !108, !132, !133, !135, !139, !142, !144, !157, !160, !164, !165, !166}
!104 = !DIGlobalVariable(name: "camPos", linkageName: "\01?camPos@Camerab@@3V?$vector@M$02@@B", scope: !0, file: !1, line: 44, type: !105, isLocal: false, isDefinition: true)
!105 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !23)
!106 = !DIGlobalVariable(name: "pad0", linkageName: "\01?pad0@Camerab@@3MB", scope: !0, file: !1, line: 45, type: !107, isLocal: false, isDefinition: true)
!107 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!108 = !DIGlobalVariable(name: "InvVieProj", linkageName: "\01?InvVieProj@Camerab@@3V?$matrix@M$03$03@@B", scope: !0, file: !1, line: 46, type: !109, isLocal: false, isDefinition: true)
!109 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !110)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 46, baseType: !111)
!111 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 46, size: 512, align: 32, elements: !112, templateParams: !129)
!112 = !{!113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !111, file: !1, line: 46, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !111, file: !1, line: 46, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !111, file: !1, line: 46, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !111, file: !1, line: 46, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !111, file: !1, line: 46, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !111, file: !1, line: 46, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !111, file: !1, line: 46, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !111, file: !1, line: 46, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !111, file: !1, line: 46, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !111, file: !1, line: 46, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !111, file: !1, line: 46, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !111, file: !1, line: 46, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !111, file: !1, line: 46, baseType: !8, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !111, file: !1, line: 46, baseType: !8, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !111, file: !1, line: 46, baseType: !8, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !111, file: !1, line: 46, baseType: !8, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!129 = !{!11, !130, !131}
!130 = !DITemplateValueParameter(name: "row_count", type: !13, value: i32 4)
!131 = !DITemplateValueParameter(name: "col_count", type: !13, value: i32 4)
!132 = !DIGlobalVariable(name: "pad1", linkageName: "\01?pad1@Camerab@@3MB", scope: !0, file: !1, line: 47, type: !107, isLocal: false, isDefinition: true)
!133 = !DIGlobalVariable(name: "RAY_FLAG_NONE", scope: !0, file: !1, line: 88, type: !134, isLocal: true, isDefinition: true, variable: i32 0)
!134 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !56)
!135 = !DIGlobalVariable(name: "accumulationTexture", linkageName: "\01?accumulationTexture@@3V?$RWTexture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 31, type: !136, isLocal: false, isDefinition: true, variable: %dx.types.Handle* @"\01?accumulationTexture@@3V?$RWTexture2D@V?$vector@M$03@@@@A")
!136 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<vector<float, 4> >", file: !1, line: 31, size: 128, align: 32, elements: !2, templateParams: !137)
!137 = !{!138}
!138 = !DITemplateTypeParameter(name: "element", type: !15)
!139 = !DIGlobalVariable(name: "randPattern", linkageName: "\01?randPattern@@3V?$RWBuffer@I@@A", scope: !0, file: !1, line: 32, type: !140, isLocal: false, isDefinition: true, variable: %dx.types.Handle* @"\01?randPattern@@3V?$RWBuffer@I@@A")
!140 = !DICompositeType(tag: DW_TAG_class_type, name: "RWBuffer<unsigned int>", file: !1, line: 32, size: 32, align: 32, elements: !2, templateParams: !141)
!141 = !{!77}
!142 = !DIGlobalVariable(name: "scene", linkageName: "\01?scene@@3URaytracingAccelerationStructure@@A", scope: !0, file: !1, line: 34, type: !143, isLocal: false, isDefinition: true, variable: %dx.types.Handle* @"\01?scene@@3URaytracingAccelerationStructure@@A")
!143 = !DICompositeType(tag: DW_TAG_structure_type, name: "RaytracingAccelerationStructure", file: !1, line: 34, size: 32, align: 32, elements: !2)
!144 = !DIGlobalVariable(name: "VertexBuffers", linkageName: "\01?VertexBuffers@@3PAV?$StructuredBuffer@UVertex@@@@A", scope: !0, file: !1, line: 36, type: !145, isLocal: false, isDefinition: true, variable: [0 x %dx.types.Handle]* @"\01?VertexBuffers@@3PAV?$StructuredBuffer@UVertex@@@@A")
!145 = !DICompositeType(tag: DW_TAG_array_type, baseType: !146, size: 288, align: 32, elements: !155)
!146 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<Vertex>", file: !1, line: 36, size: 288, align: 32, elements: !2, templateParams: !147)
!147 = !{!148}
!148 = !DITemplateTypeParameter(name: "element", type: !149)
!149 = !DICompositeType(tag: DW_TAG_structure_type, name: "Vertex", file: !1, line: 13, size: 288, align: 32, elements: !150)
!150 = !{!151, !152, !153, !154}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !149, file: !1, line: 15, baseType: !23, size: 96, align: 32)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "normal", scope: !149, file: !1, line: 16, baseType: !23, size: 96, align: 32, offset: 96)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "texcoord", scope: !149, file: !1, line: 17, baseType: !4, size: 64, align: 32, offset: 192)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "materialIndex", scope: !149, file: !1, line: 18, baseType: !55, size: 32, align: 32, offset: 256)
!155 = !{!156}
!156 = !DISubrange(count: 1)
!157 = !DIGlobalVariable(name: "IndexBuffers", linkageName: "\01?IndexBuffers@@3PAV?$Buffer@I@@A", scope: !0, file: !1, line: 37, type: !158, isLocal: false, isDefinition: true, variable: [0 x %dx.types.Handle]* @"\01?IndexBuffers@@3PAV?$Buffer@I@@A")
!158 = !DICompositeType(tag: DW_TAG_array_type, baseType: !159, size: 32, align: 32, elements: !155)
!159 = !DICompositeType(tag: DW_TAG_class_type, name: "Buffer<unsigned int>", file: !1, line: 37, size: 32, align: 32, elements: !2, templateParams: !141)
!160 = !DIGlobalVariable(name: "Materials", linkageName: "\01?Materials@@3V?$StructuredBuffer@UMaterial@@@@A", scope: !0, file: !1, line: 39, type: !161, isLocal: false, isDefinition: true, variable: %dx.types.Handle* @"\01?Materials@@3V?$StructuredBuffer@UMaterial@@@@A")
!161 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<Material>", file: !1, line: 39, size: 256, align: 32, elements: !2, templateParams: !162)
!162 = !{!163}
!163 = !DITemplateTypeParameter(name: "element", type: !79)
!164 = !DIGlobalVariable(name: "materialIndexBuffer", linkageName: "\01?materialIndexBuffer@@3V?$Buffer@I@@A", scope: !0, file: !1, line: 40, type: !159, isLocal: false, isDefinition: true, variable: %dx.types.Handle* @"\01?materialIndexBuffer@@3V?$Buffer@I@@A")
!165 = !DIGlobalVariable(name: "skyTop", scope: !0, file: !1, line: 52, type: !105, isLocal: true, isDefinition: true)
!166 = !DIGlobalVariable(name: "skyBottom", scope: !0, file: !1, line: 53, type: !105, isLocal: true, isDefinition: true)
!167 = !{i32 2, !"Dwarf Version", i32 4}
!168 = !{i32 2, !"Debug Info Version", i32 3}
!169 = !{!"dxcoob 1.8.2502.11 (239921522)"}
