#if 0
;
; Note: shader requires additional functionality:
;       Double-precision floating point
;
; shader debug name: 34b4de4b34656e24f0320264a3c76a14.pdb
; shader hash: 34b4de4b34656e24f0320264a3c76a14
;
; Buffer Definitions:
;
;
; Resource Bindings:
;
; Name                                 Type  Format         Dim      ID      HLSL Bind  Count
; ------------------------------ ---------- ------- ----------- ------- -------------- ------
; scene                             texture     i32         ras      T0             t0     1
; uav                                   UAV     f32          2d      U0             u0     1
;
target datalayout = "e-m:e-p:32:32-i1:32-i8:32-i16:32-i32:32-i64:64-f16:32-f32:32-f64:64-n8:16:32:64"
target triple = "dxil-ms-dx"

%struct.RaytracingAccelerationStructure = type { i32 }
%"class.RWTexture2D<vector<float, 4> >" = type { <4 x float> }
%struct.Payload = type { <3 x float>, i32, i32 }
%dx.types.Handle = type { i8* }
%struct.BuiltInTriangleIntersectionAttributes = type { <2 x float> }

@"\01?scene@@3URaytracingAccelerationStructure@@A" = external constant %struct.RaytracingAccelerationStructure, align 4
@"\01?uav@@3V?$RWTexture2D@V?$vector@M$03@@@@A" = external constant %"class.RWTexture2D<vector<float, 4> >", align 4
@dx.nothing.a = internal constant [1 x i32] zeroinitializer

; Function Attrs: nounwind
define void @"\01?RayGeneration@@YAXXZ"() #0 {

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxcoob 1.8.2505.32 (b106a961d)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !48, globals: !80)
!1 = !DIFile(filename: "shader.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !15, !24, !33}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 27, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 27, size: 96, align: 32, elements: !6, templateParams: !11)
!6 = !{!7, !9, !10}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 27, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 27, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 27, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !{!12, !13}
!12 = !DITemplateTypeParameter(name: "element", type: !8)
!13 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 3)
!14 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 41, baseType: !16)
!16 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 41, size: 128, align: 32, elements: !17, templateParams: !22)
!17 = !{!18, !19, !20, !21}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !16, file: !1, line: 41, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !16, file: !1, line: 41, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !16, file: !1, line: 41, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !16, file: !1, line: 41, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!22 = !{!12, !23}
!23 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 4)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, line: 57, baseType: !25)
!25 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, line: 57, size: 96, align: 32, elements: !26, templateParams: !31)
!26 = !{!27, !29, !30}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !25, file: !1, line: 57, baseType: !28, size: 32, align: 32, flags: DIFlagPublic)
!28 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !25, file: !1, line: 57, baseType: !28, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !25, file: !1, line: 57, baseType: !28, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!31 = !{!32, !13}
!32 = !DITemplateTypeParameter(name: "element", type: !28)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3x3", file: !1, line: 58, baseType: !34)
!34 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 3, 3>", file: !1, line: 58, size: 288, align: 32, elements: !35, templateParams: !45)
!35 = !{!36, !37, !38, !39, !40, !41, !42, !43, !44}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !34, file: !1, line: 58, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !34, file: !1, line: 58, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !34, file: !1, line: 58, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !34, file: !1, line: 58, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !34, file: !1, line: 58, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !34, file: !1, line: 58, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !34, file: !1, line: 58, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !34, file: !1, line: 58, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !34, file: !1, line: 58, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!45 = !{!12, !46, !47}
!46 = !DITemplateValueParameter(name: "row_count", type: !14, value: i32 3)
!47 = !DITemplateValueParameter(name: "col_count", type: !14, value: i32 3)
!48 = !{!49, !52, !62, !72, !73, !74}
!49 = !DISubprogram(name: "RayGeneration", linkageName: "\01?RayGeneration@@YAXXZ", scope: !1, file: !1, line: 20, type: !50, isLocal: false, isDefinition: true, scopeLine: 21, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @"\01?RayGeneration@@YAXXZ")
!50 = !DISubroutineType(types: !51)
!51 = !{null}
!52 = !DISubprogram(name: "Miss", linkageName: "\01?Miss@@YAXUPayload@@@Z", scope: !1, file: !1, line: 45, type: !53, isLocal: false, isDefinition: true, scopeLine: 46, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.Payload*)* @"\01?Miss@@YAXUPayload@@@Z")
!53 = !DISubroutineType(types: !54)
!54 = !{null, !55}
!55 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !56)
!56 = !DICompositeType(tag: DW_TAG_structure_type, name: "Payload", file: !1, line: 1, size: 160, align: 32, elements: !57)
!57 = !{!58, !59, !61}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !56, file: !1, line: 3, baseType: !4, size: 96, align: 32)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "allowReflection", scope: !56, file: !1, line: 4, baseType: !60, size: 32, align: 32, offset: 96)
!60 = !DIBasicType(name: "bool", size: 32, align: 32, encoding: DW_ATE_boolean)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "missed", scope: !56, file: !1, line: 5, baseType: !60, size: 32, align: 32, offset: 128)
!62 = !DISubprogram(name: "HitCube", linkageName: "\01?HitCube@@YAXUPayload@@V?$vector@M$01@@@Z", scope: !1, file: !1, line: 53, type: !63, isLocal: false, isDefinition: true, scopeLine: 54, flags: DIFlagPrototyped, isOptimized: false)
!63 = !DISubroutineType(types: !64)
!64 = !{null, !55, !65}
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 24, baseType: !66)
!66 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 24, size: 64, align: 32, elements: !67, templateParams: !70)
!67 = !{!68, !69}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !66, file: !1, line: 24, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !66, file: !1, line: 24, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!70 = !{!12, !71}
!71 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 2)
!72 = !DISubprogram(name: "HitMirror", linkageName: "\01?HitMirror@@YAXUPayload@@V?$vector@M$01@@@Z", scope: !1, file: !1, line: 70, type: !63, isLocal: false, isDefinition: true, scopeLine: 71, flags: DIFlagPrototyped, isOptimized: false)
!73 = !DISubprogram(name: "HitFloor", linkageName: "\01?HitFloor@@YAXUPayload@@V?$vector@M$01@@@Z", scope: !1, file: !1, line: 91, type: !63, isLocal: false, isDefinition: true, scopeLine: 92, flags: DIFlagPrototyped, isOptimized: false)
!74 = !DISubprogram(name: "ClosestHit", linkageName: "\01?ClosestHit@@YAXUPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !1, file: !1, line: 117, type: !75, isLocal: false, isDefinition: true, scopeLine: 118, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.Payload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ClosestHit@@YAXUPayload@@UBuiltInTriangleIntersectionAttributes@@@Z")
!75 = !DISubroutineType(types: !76)
!76 = !{null, !55, !77}
!77 = !DICompositeType(tag: DW_TAG_structure_type, name: "BuiltInTriangleIntersectionAttributes", file: !1, line: 114, size: 64, align: 32, elements: !78)
!78 = !{!79}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "barycentrics", scope: !77, file: !1, line: 114, baseType: !66, size: 64, align: 32)
!80 = !{!81, !83, !85, !89, !91, !92, !93, !94, !96, !98, !100, !101, !102, !103, !104, !105}
!81 = !DIGlobalVariable(name: "RAY_FLAG_NONE", scope: !0, file: !1, line: 39, type: !82, isLocal: true, isDefinition: true, variable: i32 0)
!82 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !28)
!83 = !DIGlobalVariable(name: "scene", linkageName: "\01?scene@@3URaytracingAccelerationStructure@@A", scope: !0, file: !1, line: 9, type: !84, isLocal: false, isDefinition: true, variable: %struct.RaytracingAccelerationStructure* @"\01?scene@@3URaytracingAccelerationStructure@@A")
!84 = !DICompositeType(tag: DW_TAG_structure_type, name: "RaytracingAccelerationStructure", file: !1, line: 9, size: 32, align: 32, elements: !2)
!85 = !DIGlobalVariable(name: "uav", linkageName: "\01?uav@@3V?$RWTexture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 11, type: !86, isLocal: false, isDefinition: true, variable: %"class.RWTexture2D<vector<float, 4> >"* @"\01?uav@@3V?$RWTexture2D@V?$vector@M$03@@@@A")
!86 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<vector<float, 4> >", file: !1, line: 11, size: 128, align: 32, elements: !2, templateParams: !87)
!87 = !{!88}
!88 = !DITemplateTypeParameter(name: "element", type: !16)
!89 = !DIGlobalVariable(name: "camera", scope: !0, file: !1, line: 14, type: !90, isLocal: true, isDefinition: true)
!90 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!91 = !DIGlobalVariable(name: "light", scope: !0, file: !1, line: 15, type: !90, isLocal: true, isDefinition: true)
!92 = !DIGlobalVariable(name: "skyTop", scope: !0, file: !1, line: 16, type: !90, isLocal: true, isDefinition: true)
!93 = !DIGlobalVariable(name: "skyBottom", scope: !0, file: !1, line: 17, type: !90, isLocal: true, isDefinition: true)
!94 = !DIGlobalVariable(name: "camera.0", linkageName: "camera.0", scope: !0, file: !1, line: 14, type: !95, isLocal: false, isDefinition: true)
!95 = !DIDerivedType(tag: DW_TAG_member, name: ".0", baseType: !90, size: 32, align: 4)
!96 = !DIGlobalVariable(name: "camera.1", linkageName: "camera.1", scope: !0, file: !1, line: 14, type: !97, isLocal: false, isDefinition: true)
!97 = !DIDerivedType(tag: DW_TAG_member, name: ".1", baseType: !90, size: 32, align: 4, offset: 32)
!98 = !DIGlobalVariable(name: "camera.2", linkageName: "camera.2", scope: !0, file: !1, line: 14, type: !99, isLocal: false, isDefinition: true)
!99 = !DIDerivedType(tag: DW_TAG_member, name: ".2", baseType: !90, size: 32, align: 4, offset: 64)
!100 = !DIGlobalVariable(name: "skyBottom.0", linkageName: "skyBottom.0", scope: !0, file: !1, line: 17, type: !95, isLocal: false, isDefinition: true)
!101 = !DIGlobalVariable(name: "skyBottom.1", linkageName: "skyBottom.1", scope: !0, file: !1, line: 17, type: !97, isLocal: false, isDefinition: true)
!102 = !DIGlobalVariable(name: "skyBottom.2", linkageName: "skyBottom.2", scope: !0, file: !1, line: 17, type: !99, isLocal: false, isDefinition: true)
!103 = !DIGlobalVariable(name: "skyTop.0", linkageName: "skyTop.0", scope: !0, file: !1, line: 16, type: !95, isLocal: false, isDefinition: true)
!104 = !DIGlobalVariable(name: "skyTop.1", linkageName: "skyTop.1", scope: !0, file: !1, line: 16, type: !97, isLocal: false, isDefinition: true)
!105 = !DIGlobalVariable(name: "skyTop.2", linkageName: "skyTop.2", scope: !0, file: !1, line: 16, type: !99, isLocal: false, isDefinition: true)
!106 = !{i32 2, !"Dwarf Version", i32 4}
!107 = !{i32 2, !"Debug Info Version", i32 3}
!108 = !{!"dxcoob 1.8.2505.32 (b106a961d)"}
!109 = !{!"shader.hlsl", !"struct Payload\0D\0A{\0D\0A    float3 color;\0D\0A    bool allowReflection;\0D\0A    bool missed;\0D\0A    \0D\0A};\0D\0A\0D\0ARaytracingAccelerationStructure scene : register(t0);\0D\0A\0D\0ARWTexture2D<float4> uav : register(u0);\0D\0A\0D\0A// constants\0D\0Astatic const float3 camera = float3(0, 1.5, -7);\0D\0Astatic const float3 light = float3(0, 200, 0);\0D\0Astatic const float3 skyTop = float3(0.24, 0.44, 0.72);\0D\0Astatic const float3 skyBottom = float3(0.75, 0.86, 0.93);\0D\0A\0D\0A[shader(\22raygeneration\22)]\0D\0Avoid RayGeneration()\0D\0A{\0D\0A    \0D\0A    uint2 idx = DispatchRaysIndex().xy;\0D\0A    float2 size = DispatchRaysDimensions().xy;\0D\0A    \0D\0A    float2 uv = idx / size;\0D\0A    float3 target = float3((uv.x * 2 - 1) * 1.8 * (size.x / size.y), (1 - uv.y) * 4 - 2 + camera.y, 0);\0D\0A    \0D\0A    RayDesc ray;\0D\0A    ray.Origin = camera;\0D\0A    ray.Direction = target - camera;\0D\0A    ray.TMin = 0.001;\0D\0A    ray.TMax = 1000;\0D\0A    \0D\0A    Payload payload;\0D\0A    payload.allowReflection = true;\0D\0A    payload.missed = false;\0D\0A    \0D\0A    TraceRay(scene, RAY_FLAG_NONE, 0xFF, 0, 0, 0, ray, payload);\0D\0A\0D\0A    uav[idx] = float4(payload.color, 1);\0D\0A}\0D\0A\0D\0A[shader(\22miss\22)]\0D\0Avoid Miss(inout Payload payload)\0D\0A{\0D\0A    float slope = normalize(WorldRayDirection()).y;\0D\0A    float t = saturate(slope * 5 + 0.5);\0D\0A    payload.color = lerp(skyBottom, skyTop, t);\0D\0A    payload.missed = true;\0D\0A}\0D\0A\0D\0Avoid HitCube(inout Payload payload, float2 uv)\0D\0A{\0D\0A    uint tri = PrimitiveIndex();\0D\0A    tri /= 2;\0D\0A    float3 normal = (tri.xxx % 3 == uint3(0, 1, 2)) * (tri < 3 ? -1 : 1);\0D\0A    float3 worldNormal = normalize(mul(normal, (float3x3) ObjectToWorld4x3()));\0D\0A    \0D\0A    float3 color = abs(normal) / 3 + 0.5;\0D\0A    if (uv.x < 0.03 || uv.y < 0.03)\0D\0A        color = 0.25.rrr;\0D\0A    \0D\0A    color *= saturate(dot(worldNormal, normalize(light))) + 0.33;\0D\0A    payload.color = color;\0D\0A\0D\0A}\0D\0A\0D\0A\0D\0Avoid HitMirror(inout Payload payload, float2 uv)\0D\0A{\0D\0A    \0D\0A    if (!payload.allowReflection)\0D\0A        return;\0D\0A    \0D\0A    float3 pos = WorldRayOrigin() + WorldRayDirection() * RayTCurrent();\0D\0A    float3 normal = normalize(mul(float3(0, 1, 0), (float3x3) ObjectToWorld4x3()));\0D\0A    float3 reflected = reflect(normalize(WorldRayDirection()), normal);\0D\0A    \0D\0A    RayDesc mirrorRay;\0D\0A    mirrorRay.Origin = pos;\0D\0A    mirrorRay.Direction = reflected;\0D\0A    mirrorRay.TMin = 0.001;\0D\0A    mirrorRay.TMax = 1000;\0D\0A    \0D\0A    payload.allowReflection = false;\0D\0A    TraceRay(scene, RAY_FLAG_NONE, 0xFF, 0, 0, 0, mirrorRay, payload);\0D\0A}\0D\0A\0D\0A\0D\0Avoid HitFloor(inout Payload payload, float2 uv)\0D\0A{\0D\0A    float3 pos = WorldRayOrigin() + WorldRayDirection() * RayTCurrent();\0D\0A    \0D\0A    bool2 pattern = frac(pos.xz) > 0.5;\0D\0A    payload.color = (pattern.x ^ pattern.y ? 0.6 : 0.4).rrr;\0D\0A    \0D\0A    RayDesc shadowRay;\0D\0A    shadowRay.Origin = pos;\0D\0A    shadowRay.Direction = light - pos;\0D\0A    shadowRay.TMin = 0.001;\0D\0A    shadowRay.TMax = 1;\0D\0A    \0D\0A    Payload shadow;\0D\0A    shadow.allowReflection = false;\0D\0A    shadow.missed = false;\0D\0A    TraceRay(scene, RAY_FLAG_NONE, 0xFF, 0, 0, 0, shadowRay, shadow);\0D\0A    \0D\0A    if (!shadow.missed)\0D\0A    {\0D\0A        payload.color /= 2;\0D\0A    }\0D\0A\0D\0A}\0D\0A\0D\0A[shader(\22closesthit\22)]\0D\0Avoid ClosestHit(inout Payload payload, BuiltInTriangleIntersectionAttributes attribs)\0D\0A{\0D\0A    float2 uv = attribs.barycentrics;\0D\0A    \0D\0A    switch (InstanceID())\0D\0A    {\0D\0A        case 0:\0D\0A            HitCube(payload, uv);\0D\0A            break;\0D\0A        \0D\0A        case 1:\0D\0A            HitMirror(payload, uv);\0D\0A            break;\0D\0A        \0D\0A        case 2:\0D\0A            HitFloor(payload, uv);\0D\0A            break;\0D\0A        \0D\0A        default:\0D\0A            payload.color = float3(1, 0, 1);\0D\0A            break;\0D\0A        \0D\0A    }\0D\0A\0D\0A}"}
!110 = !{!"shader.hlsl"}
!111 = !{!"-E", !"lib.no::entry", !"-T", !"lib_6_3", !"/Fo", !"C:\5CUsers\5Chazza\5Csource\5Crepos\5CDX12PathTracer\5Cx64\5CDebug\5Cshader.cso", !"/Od", !"/Zi", !"-Qembed_debug"}
!112 = !{i32 1, i32 3}
!113 = !{i32 1, i32 9}
!114 = !{!"lib", i32 6, i32 3}
!115 = !{!116, !119, null, null}
!116 = !{!117}
!117 = !{i32 0, %struct.RaytracingAccelerationStructure* @"\01?scene@@3URaytracingAccelerationStructure@@A", !"scene", i32 0, i32 0, i32 1, i32 16, i32 0, !118}
!118 = !{i32 0, i32 4}
!119 = !{!120}
!120 = !{i32 0, %"class.RWTexture2D<vector<float, 4> >"* @"\01?uav@@3V?$RWTexture2D@V?$vector@M$03@@@@A", !"uav", i32 0, i32 0, i32 1, i32 2, i1 false, i1 false, i1 false, !121}
!121 = !{i32 0, i32 9}
!122 = !{i32 0, %struct.Payload undef, !123, %struct.BuiltInTriangleIntersectionAttributes undef, !127}
!123 = !{i32 20, !124, !125, !126}
!124 = !{i32 6, !"color", i32 3, i32 0, i32 7, i32 9}
!125 = !{i32 6, !"allowReflection", i32 3, i32 12, i32 7, i32 1}
!126 = !{i32 6, !"missed", i32 3, i32 16, i32 7, i32 1}
!127 = !{i32 8, !128}
!128 = !{i32 6, !"barycentrics", i32 3, i32 0, i32 7, i32 9}
!129 = !{i32 1, void ()* @"\01?RayGeneration@@YAXXZ", !130, void (%struct.Payload*)* @"\01?Miss@@YAXUPayload@@@Z", !132, void (%struct.Payload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ClosestHit@@YAXUPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !134}
!130 = !{!131}
!131 = !{i32 1, !2, !2}
!132 = !{!131, !133}
!133 = !{i32 2, !2, !2}
!134 = !{!131, !133, !135}
!135 = !{i32 0, !2, !2}
!136 = !{null, !"", null, !115, !137}
!137 = !{i32 0, i64 5}
!138 = !{void (%struct.Payload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ClosestHit@@YAXUPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !"\01?ClosestHit@@YAXUPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", null, null, !139}
!139 = !{i32 8, i32 10, i32 6, i32 20, i32 7, i32 8, i32 5, !140}
!140 = !{i32 0}
!141 = !{void (%struct.Payload*)* @"\01?Miss@@YAXUPayload@@@Z", !"\01?Miss@@YAXUPayload@@@Z", null, null, !142}
!142 = !{i32 8, i32 11, i32 6, i32 20, i32 5, !140}
!143 = !{void ()* @"\01?RayGeneration@@YAXXZ", !"\01?RayGeneration@@YAXXZ", null, null, !144}
!144 = !{i32 8, i32 7, i32 5, !140}
!145 = !DILocation(line: 39, column: 5, scope: !49)
!146 = !DILocation(line: 41, column: 5, scope: !49)
!147 = !DILocation(line: 23, column: 17, scope: !49)
!148 = !DILocation(line: 23, column: 11, scope: !49)
!149 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "idx", scope: !49, file: !1, line: 23, type: !150)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, line: 23, baseType: !151)
!151 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 23, size: 64, align: 32, elements: !152, templateParams: !155)
!152 = !{!153, !154}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !151, file: !1, line: 23, baseType: !28, size: 32, align: 32, flags: DIFlagPublic)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !151, file: !1, line: 23, baseType: !28, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!155 = !{!32, !71}
!156 = !DIExpression(DW_OP_bit_piece, 0, 32)
!157 = !DIExpression(DW_OP_bit_piece, 32, 32)
!158 = !DILocation(line: 24, column: 19, scope: !49)
!159 = !DILocation(line: 24, column: 12, scope: !49)
!160 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !49, file: !1, line: 24, type: !65)
!161 = !DILocation(line: 26, column: 17, scope: !49)
!162 = !DILocation(line: 26, column: 21, scope: !49)
!163 = !DILocation(line: 26, column: 12, scope: !49)
!164 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "uv", scope: !49, file: !1, line: 26, type: !65)
!165 = !DILocation(line: 27, column: 34, scope: !49)
!166 = !DILocation(line: 27, column: 38, scope: !49)
!167 = !DILocation(line: 27, column: 43, scope: !49)
!168 = !DILocation(line: 27, column: 59, scope: !49)
!169 = !DILocation(line: 27, column: 49, scope: !49)
!170 = !DILocation(line: 27, column: 73, scope: !49)
!171 = !DILocation(line: 27, column: 81, scope: !49)
!172 = !DILocation(line: 27, column: 85, scope: !49)
!173 = !DILocation(line: 27, column: 91, scope: !49)
!174 = !DILocation(line: 27, column: 89, scope: !49)
!175 = !DILocation(line: 27, column: 12, scope: !49)
!176 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "target", scope: !49, file: !1, line: 27, type: !4)
!177 = !DIExpression(DW_OP_bit_piece, 64, 32)
!178 = !DILocation(line: 30, column: 18, scope: !49)
!179 = !DILocation(line: 30, column: 16, scope: !49)
!180 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ray", scope: !49, file: !1, line: 29, type: !181)
!181 = !DICompositeType(tag: DW_TAG_structure_type, name: "RayDesc", file: !1, line: 29, size: 256, align: 32, elements: !182)
!182 = !{!183, !184, !185, !186}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "Origin", scope: !181, file: !1, line: 29, baseType: !5, size: 96, align: 32)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "TMin", scope: !181, file: !1, line: 29, baseType: !8, size: 32, align: 32, offset: 96)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "Direction", scope: !181, file: !1, line: 29, baseType: !5, size: 96, align: 32, offset: 128)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "TMax", scope: !181, file: !1, line: 29, baseType: !8, size: 32, align: 32, offset: 224)
!187 = !DILocation(line: 29, column: 13, scope: !49)
!188 = !DILocation(line: 31, column: 30, scope: !49)
!189 = !DILocation(line: 31, column: 28, scope: !49)
!190 = !DILocation(line: 31, column: 19, scope: !49)
!191 = !DIExpression(DW_OP_bit_piece, 128, 32)
!192 = !DIExpression(DW_OP_bit_piece, 160, 32)
!193 = !DIExpression(DW_OP_bit_piece, 192, 32)
!194 = !DILocation(line: 32, column: 14, scope: !49)
!195 = !DIExpression(DW_OP_bit_piece, 96, 32)
!196 = !DILocation(line: 33, column: 14, scope: !49)
!197 = !DIExpression(DW_OP_bit_piece, 224, 32)
!198 = !DILocation(line: 36, column: 29, scope: !49)
!199 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "payload", scope: !49, file: !1, line: 35, type: !56)
!200 = !DILocation(line: 35, column: 13, scope: !49)
!201 = !DILocation(line: 37, column: 20, scope: !49)
!202 = !DILocation(line: 41, column: 31, scope: !49)
!203 = !DIExpression(DW_OP_bit_piece, 0, 96)
!204 = !DILocation(line: 41, column: 22, scope: !49)
!205 = !DILocation(line: 41, column: 14, scope: !49)
!206 = !DILocation(line: 42, column: 1, scope: !49)
!207 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "payload", arg: 1, scope: !52, file: !1, line: 45, type: !56)
!208 = !DILocation(line: 45, column: 25, scope: !52)
!209 = !DILocation(line: 47, column: 29, scope: !52)
!210 = !DILocation(line: 47, column: 19, scope: !52)
!211 = !DILocation(line: 47, column: 11, scope: !52)
!212 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "slope", scope: !52, file: !1, line: 47, type: !8)
!213 = !DIExpression()
!214 = !DILocation(line: 48, column: 30, scope: !52)
!215 = !DILocation(line: 48, column: 34, scope: !52)
!216 = !DILocation(line: 48, column: 15, scope: !52)
!217 = !DILocation(line: 48, column: 11, scope: !52)
!218 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "t", scope: !52, file: !1, line: 48, type: !8)
!219 = !DILocation(line: 49, column: 37, scope: !52)
!220 = !DILocation(line: 49, column: 26, scope: !52)
!221 = !DILocation(line: 49, column: 21, scope: !52)
!222 = !DILocation(line: 49, column: 19, scope: !52)
!223 = !DILocation(line: 50, column: 20, scope: !52)
!224 = !DILocation(line: 51, column: 1, scope: !52)
!225 = !DILocation(line: 107, column: 5, scope: !73, inlinedAt: !226)
!226 = distinct !DILocation(line: 132, column: 13, scope: !227)
!227 = distinct !DILexicalBlock(scope: !74, file: !1, line: 122, column: 5)
!228 = !{!229}
!229 = distinct !{!229, !230, !"\01?HitFloor@@YAXUPayload@@V?$vector@M$01@@@Z: %payload"}
!230 = distinct !{!230, !"\01?HitFloor@@YAXUPayload@@V?$vector@M$01@@@Z"}
!231 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "attribs", arg: 2, scope: !74, file: !1, line: 117, type: !77)
!232 = !DILocation(line: 117, column: 78, scope: !74)
!233 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "payload", arg: 1, scope: !74, file: !1, line: 117, type: !56)
!234 = !DILocation(line: 117, column: 31, scope: !74)
!235 = !DILocation(line: 119, column: 25, scope: !74)
!236 = !DILocation(line: 119, column: 12, scope: !74)
!237 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "uv", scope: !74, file: !1, line: 119, type: !65)
!238 = !DILocation(line: 121, column: 13, scope: !74)
!239 = !DILocation(line: 121, column: 5, scope: !74)
!240 = !DILocation(line: 124, column: 13, scope: !227)
!241 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "uv", arg: 2, scope: !62, file: !1, line: 53, type: !65)
!242 = !DILocation(line: 53, column: 44, scope: !62, inlinedAt: !243)
!243 = distinct !DILocation(line: 124, column: 13, scope: !227)
!244 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "payload", arg: 1, scope: !62, file: !1, line: 53, type: !56)
!245 = !DILocation(line: 53, column: 28, scope: !62, inlinedAt: !243)
!246 = !DILocation(line: 55, column: 16, scope: !62, inlinedAt: !243)
!247 = !DILocation(line: 55, column: 10, scope: !62, inlinedAt: !243)
!248 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tri", scope: !62, file: !1, line: 55, type: !249)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 55, baseType: !28)
!250 = !DILocation(line: 56, column: 9, scope: !62, inlinedAt: !243)
!251 = !DILocation(line: 57, column: 22, scope: !62, inlinedAt: !243)
!252 = !DILocation(line: 57, column: 30, scope: !62, inlinedAt: !243)
!253 = !DILocation(line: 57, column: 34, scope: !62, inlinedAt: !243)
!254 = !DILocation(line: 57, column: 21, scope: !62, inlinedAt: !243)
!255 = !DILocation(line: 57, column: 60, scope: !62, inlinedAt: !243)
!256 = !DILocation(line: 57, column: 55, scope: !62, inlinedAt: !243)
!257 = !DILocation(line: 57, column: 53, scope: !62, inlinedAt: !243)
!258 = !DILocation(line: 57, column: 12, scope: !62, inlinedAt: !243)
!259 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "normal", scope: !62, file: !1, line: 57, type: !4)
!260 = !DILocation(line: 58, column: 59, scope: !62, inlinedAt: !243)
!261 = !DILocation(line: 58, column: 36, scope: !62, inlinedAt: !243)
!262 = !DILocation(line: 58, column: 26, scope: !62, inlinedAt: !243)
!263 = !DILocation(line: 58, column: 12, scope: !62, inlinedAt: !243)
!264 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "worldNormal", scope: !62, file: !1, line: 58, type: !4)
!265 = !DILocation(line: 60, column: 20, scope: !62, inlinedAt: !243)
!266 = !DILocation(line: 60, column: 32, scope: !62, inlinedAt: !243)
!267 = !DILocation(line: 60, column: 36, scope: !62, inlinedAt: !243)
!268 = !DILocation(line: 60, column: 12, scope: !62, inlinedAt: !243)
!269 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "color", scope: !62, file: !1, line: 60, type: !4)
!270 = !DILocation(line: 61, column: 9, scope: !271, inlinedAt: !243)
!271 = distinct !DILexicalBlock(scope: !62, file: !1, line: 61, column: 9)
!272 = !DILocation(line: 61, column: 14, scope: !271, inlinedAt: !243)
!273 = !DILocation(line: 61, column: 21, scope: !271, inlinedAt: !243)
!274 = !DILocation(line: 61, column: 24, scope: !271, inlinedAt: !243)
!275 = !DILocation(line: 61, column: 29, scope: !271, inlinedAt: !243)
!276 = !DILocation(line: 61, column: 9, scope: !62, inlinedAt: !243)
!277 = !DILocation(line: 62, column: 17, scope: !271, inlinedAt: !243)
!278 = !DILocation(line: 62, column: 15, scope: !271, inlinedAt: !243)
!279 = !DILocation(line: 62, column: 9, scope: !271, inlinedAt: !243)
!280 = !DILocation(line: 64, column: 50, scope: !62, inlinedAt: !243)
!281 = !DILocation(line: 64, column: 23, scope: !62, inlinedAt: !243)
!282 = !DILocation(line: 64, column: 14, scope: !62, inlinedAt: !243)
!283 = !DILocation(line: 64, column: 59, scope: !62, inlinedAt: !243)
!284 = !DILocation(line: 64, column: 11, scope: !62, inlinedAt: !243)
!285 = !DILocation(line: 65, column: 13, scope: !62, inlinedAt: !243)
!286 = !DILocation(line: 65, column: 19, scope: !62, inlinedAt: !243)
!287 = !{!288}
!288 = distinct !{!288, !289, !"\01?HitCube@@YAXUPayload@@V?$vector@M$01@@@Z: %payload"}
!289 = distinct !{!289, !"\01?HitCube@@YAXUPayload@@V?$vector@M$01@@@Z"}
!290 = !DILocation(line: 67, column: 1, scope: !62, inlinedAt: !243)
!291 = !DILocation(line: 125, column: 13, scope: !227)
!292 = !DILocation(line: 128, column: 13, scope: !227)
!293 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "payload", arg: 1, scope: !72, file: !1, line: 70, type: !56)
!294 = !DILocation(line: 70, column: 30, scope: !72, inlinedAt: !295)
!295 = distinct !DILocation(line: 128, column: 13, scope: !227)
!296 = !DILocation(line: 73, column: 18, scope: !297, inlinedAt: !295)
!297 = distinct !DILexicalBlock(scope: !72, file: !1, line: 73, column: 9)
!298 = !{!299}
!299 = distinct !{!299, !300, !"\01?HitMirror@@YAXUPayload@@V?$vector@M$01@@@Z: %payload"}
!300 = distinct !{!300, !"\01?HitMirror@@YAXUPayload@@V?$vector@M$01@@@Z"}
!301 = !DILocation(line: 73, column: 9, scope: !72, inlinedAt: !295)
!302 = !DILocation(line: 74, column: 9, scope: !297, inlinedAt: !295)
!303 = !DILocation(line: 76, column: 18, scope: !72, inlinedAt: !295)
!304 = !DILocation(line: 76, column: 37, scope: !72, inlinedAt: !295)
!305 = !DILocation(line: 76, column: 59, scope: !72, inlinedAt: !295)
!306 = !DILocation(line: 76, column: 57, scope: !72, inlinedAt: !295)
!307 = !DILocation(line: 76, column: 35, scope: !72, inlinedAt: !295)
!308 = !DILocation(line: 76, column: 12, scope: !72, inlinedAt: !295)
!309 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pos", scope: !72, file: !1, line: 76, type: !4)
!310 = !DILocation(line: 77, column: 63, scope: !72, inlinedAt: !295)
!311 = !DILocation(line: 77, column: 31, scope: !72, inlinedAt: !295)
!312 = !DILocation(line: 77, column: 21, scope: !72, inlinedAt: !295)
!313 = !DILocation(line: 77, column: 12, scope: !72, inlinedAt: !295)
!314 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "normal", scope: !72, file: !1, line: 77, type: !4)
!315 = !DILocation(line: 78, column: 42, scope: !72, inlinedAt: !295)
!316 = !DILocation(line: 78, column: 32, scope: !72, inlinedAt: !295)
!317 = !DILocation(line: 78, column: 24, scope: !72, inlinedAt: !295)
!318 = !DILocation(line: 78, column: 12, scope: !72, inlinedAt: !295)
!319 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "reflected", scope: !72, file: !1, line: 78, type: !4)
!320 = !DILocation(line: 81, column: 22, scope: !72, inlinedAt: !295)
!321 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mirrorRay", scope: !72, file: !1, line: 80, type: !181)
!322 = !DILocation(line: 80, column: 13, scope: !72, inlinedAt: !295)
!323 = !DILocation(line: 82, column: 25, scope: !72, inlinedAt: !295)
!324 = !DILocation(line: 83, column: 20, scope: !72, inlinedAt: !295)
!325 = !DILocation(line: 84, column: 20, scope: !72, inlinedAt: !295)
!326 = !DILocation(line: 86, column: 13, scope: !72, inlinedAt: !295)
!327 = !DILocation(line: 86, column: 29, scope: !72, inlinedAt: !295)
!328 = !DILocation(line: 87, column: 5, scope: !72, inlinedAt: !295)
!329 = !DILocation(line: 88, column: 1, scope: !72, inlinedAt: !295)
!330 = !DILocation(line: 129, column: 13, scope: !227)
!331 = !DILocation(line: 132, column: 13, scope: !227)
!332 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "payload", arg: 1, scope: !73, file: !1, line: 91, type: !56)
!333 = !DILocation(line: 91, column: 29, scope: !73, inlinedAt: !226)
!334 = !DILocation(line: 93, column: 18, scope: !73, inlinedAt: !226)
!335 = !DILocation(line: 93, column: 37, scope: !73, inlinedAt: !226)
!336 = !DILocation(line: 93, column: 59, scope: !73, inlinedAt: !226)
!337 = !DILocation(line: 93, column: 57, scope: !73, inlinedAt: !226)
!338 = !DILocation(line: 93, column: 35, scope: !73, inlinedAt: !226)
!339 = !DILocation(line: 93, column: 12, scope: !73, inlinedAt: !226)
!340 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pos", scope: !73, file: !1, line: 93, type: !4)
!341 = !DILocation(line: 95, column: 21, scope: !73, inlinedAt: !226)
!342 = !DILocation(line: 95, column: 34, scope: !73, inlinedAt: !226)
!343 = !DILocation(line: 95, column: 11, scope: !73, inlinedAt: !226)
!344 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pattern", scope: !73, file: !1, line: 95, type: !345)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool2", file: !1, line: 95, baseType: !346)
!346 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<bool, 2>", file: !1, line: 95, size: 64, align: 32, elements: !347, templateParams: !350)
!347 = !{!348, !349}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !346, file: !1, line: 95, baseType: !60, size: 32, align: 32, flags: DIFlagPublic)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !346, file: !1, line: 95, baseType: !60, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!350 = !{!351, !71}
!351 = !DITemplateTypeParameter(name: "element", type: !60)
!352 = !DILocation(line: 96, column: 22, scope: !73, inlinedAt: !226)
!353 = !DILocation(line: 96, column: 34, scope: !73, inlinedAt: !226)
!354 = !DILocation(line: 96, column: 32, scope: !73, inlinedAt: !226)
!355 = !DILocation(line: 96, column: 21, scope: !73, inlinedAt: !226)
!356 = !DILocation(line: 96, column: 13, scope: !73, inlinedAt: !226)
!357 = !DILocation(line: 96, column: 19, scope: !73, inlinedAt: !226)
!358 = !DILocation(line: 99, column: 22, scope: !73, inlinedAt: !226)
!359 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "shadowRay", scope: !73, file: !1, line: 98, type: !181)
!360 = !DILocation(line: 98, column: 13, scope: !73, inlinedAt: !226)
!361 = !DILocation(line: 100, column: 27, scope: !73, inlinedAt: !226)
!362 = !DILocation(line: 100, column: 33, scope: !73, inlinedAt: !226)
!363 = !DILocation(line: 100, column: 25, scope: !73, inlinedAt: !226)
!364 = !DILocation(line: 101, column: 20, scope: !73, inlinedAt: !226)
!365 = !DILocation(line: 102, column: 20, scope: !73, inlinedAt: !226)
!366 = !DILocation(line: 105, column: 28, scope: !73, inlinedAt: !226)
!367 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "shadow", scope: !73, file: !1, line: 104, type: !56)
!368 = !DILocation(line: 104, column: 13, scope: !73, inlinedAt: !226)
!369 = !DILocation(line: 106, column: 19, scope: !73, inlinedAt: !226)
!370 = !DILocation(line: 109, column: 17, scope: !371, inlinedAt: !226)
!371 = distinct !DILexicalBlock(scope: !73, file: !1, line: 109, column: 9)
!372 = !DILocation(line: 109, column: 9, scope: !73, inlinedAt: !226)
!373 = !DILocation(line: 111, column: 17, scope: !374, inlinedAt: !226)
!374 = distinct !DILexicalBlock(scope: !371, file: !1, line: 110, column: 5)
!375 = !DILocation(line: 111, column: 23, scope: !374, inlinedAt: !226)
!376 = !DILocation(line: 112, column: 5, scope: !374, inlinedAt: !226)
!377 = !DILocation(line: 114, column: 1, scope: !73, inlinedAt: !226)
!378 = !DILocation(line: 133, column: 13, scope: !227)
!379 = !DILocation(line: 136, column: 21, scope: !227)
!380 = !DILocation(line: 136, column: 27, scope: !227)
!381 = !DILocation(line: 137, column: 13, scope: !227)
!382 = !DILocation(line: 141, column: 1, scope: !74)

#endif

const unsigned char compiledShader[] = {
  0x44, 0x58, 0x42, 0x43, 0x6e, 0x15, 0xf4, 0x8d, 0xdb, 0x9f, 0x14, 0x21,
  0xe9, 0xca, 0xd7, 0x59, 0x21, 0x4c, 0xb5, 0x80, 0x01, 0x00, 0x00, 0x00,
  0x54, 0x6b, 0x00, 0x00, 0x08, 0x00, 0x00, 0x00, 0x40, 0x00, 0x00, 0x00,
  0x50, 0x00, 0x00, 0x00, 0x80, 0x00, 0x00, 0x00, 0x60, 0x02, 0x00, 0x00,
  0x54, 0x4b, 0x00, 0x00, 0xa8, 0x55, 0x00, 0x00, 0xdc, 0x55, 0x00, 0x00,
  0xf8, 0x55, 0x00, 0x00, 0x53, 0x46, 0x49, 0x30, 0x08, 0x00, 0x00, 0x00,
  0x01, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x56, 0x45, 0x52, 0x53,
  0x28, 0x00, 0x00, 0x00, 0x01, 0x00, 0x09, 0x00, 0x00, 0x00, 0x00, 0x00,
  0x56, 0x13, 0x00, 0x00, 0x15, 0x00, 0x00, 0x00, 0x62, 0x31, 0x30, 0x36,
  0x61, 0x39, 0x36, 0x31, 0x00, 0x31, 0x2e, 0x38, 0x2e, 0x32, 0x35, 0x30,
  0x35, 0x2e, 0x33, 0x32, 0x00, 0x00, 0x00, 0x00, 0x52, 0x44, 0x41, 0x54,
  0xd8, 0x01, 0x00, 0x00, 0x10, 0x00, 0x00, 0x00, 0x04, 0x00, 0x00, 0x00,
  0x18, 0x00, 0x00, 0x00, 0xc0, 0x00, 0x00, 0x00, 0x10, 0x01, 0x00, 0x00,
  0xbc, 0x01, 0x00, 0x00, 0x01, 0x00, 0x00, 0x00, 0xa0, 0x00, 0x00, 0x00,
  0x00, 0x73, 0x63, 0x65, 0x6e, 0x65, 0x00, 0x75, 0x61, 0x76, 0x00, 0x01,
  0x3f, 0x52, 0x61, 0x79, 0x47, 0x65, 0x6e, 0x65, 0x72, 0x61, 0x74, 0x69,
  0x6f, 0x6e, 0x40, 0x40, 0x59, 0x41, 0x58, 0x58, 0x5a, 0x00, 0x52, 0x61,
  0x79, 0x47, 0x65, 0x6e, 0x65, 0x72, 0x61, 0x74, 0x69, 0x6f, 0x6e, 0x00,
  0x01, 0x3f, 0x4d, 0x69, 0x73, 0x73, 0x40, 0x40, 0x59, 0x41, 0x58, 0x55,
  0x50, 0x61, 0x79, 0x6c, 0x6f, 0x61, 0x64, 0x40, 0x40, 0x40, 0x5a, 0x00,
