#if 0
; shader debug name: 714825074dba6bbc3f10011c651b8031.pdb
; shader hash: 714825074dba6bbc3f10011c651b8031
;
; Buffer Definitions:
;
; Resource bind info for VertexBuffers
; {
;
;   struct struct.Vertex
;   {
;
;       float3 position;                              ; Offset:    0
;       float3 normal;                                ; Offset:   12
;       float2 texcoord;                              ; Offset:   24
;       uint materialIndex;                           ; Offset:   32
;   
;   } $Element;                                       ; Offset:    0 Size:    36
;
; }
;
;
; Resource Bindings:
;
; Name                                 Type  Format         Dim      ID      HLSL Bind  Count
; ------------------------------ ---------- ------- ----------- ------- -------------- ------
; scene                             texture     i32         ras      T0             t0     1
; VertexBuffers                     texture  struct         r/o      T1      t1,space1unbounded
; IndexBuffers                      texture     u32         buf      T2      t2,space2unbounded
; uav                                   UAV     f32          2d      U0             u0     1
;
target datalayout = "e-m:e-p:32:32-i1:32-i8:32-i16:32-i32:32-i64:64-f16:32-f32:32-f64:64-n8:16:32:64"
target triple = "dxil-ms-dx"

%struct.RaytracingAccelerationStructure = type { i32 }
%"class.RWTexture2D<vector<float, 4> >" = type { <4 x float> }
%"class.StructuredBuffer<Vertex>" = type { %struct.Vertex }

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxcoob 1.8.2505.32 (b106a961d)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !39, globals: !70)
!1 = !DIFile(filename: "shader.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !15, !24}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 33, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 33, size: 96, align: 32, elements: !6, templateParams: !11)
!6 = !{!7, !9, !10}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 33, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 33, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 33, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !{!12, !13}
!12 = !DITemplateTypeParameter(name: "element", type: !8)
!13 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 3)
!14 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 48, baseType: !16)
!16 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 48, size: 128, align: 32, elements: !17, templateParams: !22)
!17 = !{!18, !19, !20, !21}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !16, file: !1, line: 48, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !16, file: !1, line: 48, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !16, file: !1, line: 48, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !16, file: !1, line: 48, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!22 = !{!12, !23}
!23 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 4)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3x3", file: !1, line: 77, baseType: !25)
!25 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 3, 3>", file: !1, line: 77, size: 288, align: 32, elements: !26, templateParams: !36)
!26 = !{!27, !28, !29, !30, !31, !32, !33, !34, !35}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !25, file: !1, line: 77, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !25, file: !1, line: 77, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !25, file: !1, line: 77, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !25, file: !1, line: 77, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !25, file: !1, line: 77, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !25, file: !1, line: 77, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !25, file: !1, line: 77, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !25, file: !1, line: 77, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !25, file: !1, line: 77, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!36 = !{!12, !37, !38}
!37 = !DITemplateValueParameter(name: "row_count", type: !14, value: i32 3)
!38 = !DITemplateValueParameter(name: "col_count", type: !14, value: i32 3)
!39 = !{!40, !43, !54, !64}
!40 = !DISubprogram(name: "RayGeneration", linkageName: "\01?RayGeneration@@YAXXZ", scope: !1, file: !1, line: 26, type: !41, isLocal: false, isDefinition: true, scopeLine: 27, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @"\01?RayGeneration@@YAXXZ")
!41 = !DISubroutineType(types: !42)
!42 = !{null}
!43 = !DISubprogram(name: "Miss", linkageName: "\01?Miss@@YAXUPayload@@@Z", scope: !1, file: !1, line: 51, type: !44, isLocal: false, isDefinition: true, scopeLine: 52, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.Payload*)* @"\01?Miss@@YAXUPayload@@@Z")
!44 = !DISubroutineType(types: !45)
!45 = !{null, !46}
!46 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !47)
!47 = !DICompositeType(tag: DW_TAG_structure_type, name: "Payload", file: !1, line: 1, size: 256, align: 32, elements: !48)
!48 = !{!49, !50, !51, !53}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !47, file: !1, line: 3, baseType: !4, size: 96, align: 32)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "throughput", scope: !47, file: !1, line: 4, baseType: !4, size: 96, align: 32, offset: 96)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "allowReflection", scope: !47, file: !1, line: 5, baseType: !52, size: 32, align: 32, offset: 192)
!52 = !DIBasicType(name: "bool", size: 32, align: 32, encoding: DW_ATE_boolean)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "missed", scope: !47, file: !1, line: 6, baseType: !52, size: 32, align: 32, offset: 224)
!54 = !DISubprogram(name: "Hit", linkageName: "\01?Hit@@YAXUPayload@@V?$vector@M$01@@@Z", scope: !1, file: !1, line: 58, type: !55, isLocal: false, isDefinition: true, scopeLine: 59, flags: DIFlagPrototyped, isOptimized: false)
!55 = !DISubroutineType(types: !56)
!56 = !{null, !46, !57}
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 30, baseType: !58)
!58 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 30, size: 64, align: 32, elements: !59, templateParams: !62)
!59 = !{!60, !61}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !58, file: !1, line: 30, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !58, file: !1, line: 30, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!62 = !{!12, !63}
!63 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 2)
!64 = !DISubprogram(name: "ClosestHit", linkageName: "\01?ClosestHit@@YAXUPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !1, file: !1, line: 90, type: !65, isLocal: false, isDefinition: true, scopeLine: 91, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.Payload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ClosestHit@@YAXUPayload@@UBuiltInTriangleIntersectionAttributes@@@Z")
!65 = !DISubroutineType(types: !66)
!66 = !{null, !46, !67}
!67 = !DICompositeType(tag: DW_TAG_structure_type, name: "BuiltInTriangleIntersectionAttributes", file: !1, line: 88, size: 64, align: 32, elements: !68)
!68 = !{!69}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "barycentrics", scope: !67, file: !1, line: 88, baseType: !58, size: 64, align: 32)
!70 = !{!71, !74, !76, !80, !94, !99, !101, !102, !103, !104, !106, !108, !110, !111, !112, !113, !114, !115}
!71 = !DIGlobalVariable(name: "RAY_FLAG_NONE", scope: !0, file: !1, line: 47, type: !72, isLocal: true, isDefinition: true, variable: i32 0)
!72 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !73)
!73 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!74 = !DIGlobalVariable(name: "scene", linkageName: "\01?scene@@3URaytracingAccelerationStructure@@A", scope: !0, file: !1, line: 16, type: !75, isLocal: false, isDefinition: true, variable: %struct.RaytracingAccelerationStructure* @"\01?scene@@3URaytracingAccelerationStructure@@A")
!75 = !DICompositeType(tag: DW_TAG_structure_type, name: "RaytracingAccelerationStructure", file: !1, line: 16, size: 32, align: 32, elements: !2)
!76 = !DIGlobalVariable(name: "uav", linkageName: "\01?uav@@3V?$RWTexture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 17, type: !77, isLocal: false, isDefinition: true, variable: %"class.RWTexture2D<vector<float, 4> >"* @"\01?uav@@3V?$RWTexture2D@V?$vector@M$03@@@@A")
!77 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<vector<float, 4> >", file: !1, line: 17, size: 128, align: 32, elements: !2, templateParams: !78)
!78 = !{!79}
!79 = !DITemplateTypeParameter(name: "element", type: !16)
!80 = !DIGlobalVariable(name: "VertexBuffers", linkageName: "\01?VertexBuffers@@3PAV?$StructuredBuffer@UVertex@@@@A", scope: !0, file: !1, line: 18, type: !81, isLocal: false, isDefinition: true, variable: [0 x %"class.StructuredBuffer<Vertex>"]* @"\01?VertexBuffers@@3PAV?$StructuredBuffer@UVertex@@@@A")
!81 = !DICompositeType(tag: DW_TAG_array_type, baseType: !82, size: 288, align: 32, elements: !92)
!82 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<Vertex>", file: !1, line: 18, size: 288, align: 32, elements: !2, templateParams: !83)
!83 = !{!84}
!84 = !DITemplateTypeParameter(name: "element", type: !85)
!85 = !DICompositeType(tag: DW_TAG_structure_type, name: "Vertex", file: !1, line: 8, size: 288, align: 32, elements: !86)
!86 = !{!87, !88, !89, !90}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !85, file: !1, line: 10, baseType: !4, size: 96, align: 32)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "normal", scope: !85, file: !1, line: 11, baseType: !4, size: 96, align: 32, offset: 96)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "texcoord", scope: !85, file: !1, line: 12, baseType: !57, size: 64, align: 32, offset: 192)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "materialIndex", scope: !85, file: !1, line: 13, baseType: !91, size: 32, align: 32, offset: 256)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 60, baseType: !73)
!92 = !{!93}
!93 = !DISubrange(count: 1)
!94 = !DIGlobalVariable(name: "IndexBuffers", linkageName: "\01?IndexBuffers@@3PAV?$Buffer@I@@A", scope: !0, file: !1, line: 19, type: !95, isLocal: false, isDefinition: true, variable: [0 x %"class.Buffer<unsigned int>"]* @"\01?IndexBuffers@@3PAV?$Buffer@I@@A")
!95 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 32, align: 32, elements: !92)
!96 = !DICompositeType(tag: DW_TAG_class_type, name: "Buffer<unsigned int>", file: !1, line: 19, size: 32, align: 32, elements: !2, templateParams: !97)
!97 = !{!98}
!98 = !DITemplateTypeParameter(name: "element", type: !73)
!99 = !DIGlobalVariable(name: "camera", scope: !0, file: !1, line: 21, type: !100, isLocal: true, isDefinition: true)
!100 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!101 = !DIGlobalVariable(name: "light", scope: !0, file: !1, line: 22, type: !100, isLocal: true, isDefinition: true)
!102 = !DIGlobalVariable(name: "skyTop", scope: !0, file: !1, line: 23, type: !100, isLocal: true, isDefinition: true)
!103 = !DIGlobalVariable(name: "skyBottom", scope: !0, file: !1, line: 24, type: !100, isLocal: true, isDefinition: true)
!104 = !DIGlobalVariable(name: "camera.0", linkageName: "camera.0", scope: !0, file: !1, line: 21, type: !105, isLocal: false, isDefinition: true)
!105 = !DIDerivedType(tag: DW_TAG_member, name: ".0", baseType: !100, size: 32, align: 4)
!106 = !DIGlobalVariable(name: "camera.1", linkageName: "camera.1", scope: !0, file: !1, line: 21, type: !107, isLocal: false, isDefinition: true)
!107 = !DIDerivedType(tag: DW_TAG_member, name: ".1", baseType: !100, size: 32, align: 4, offset: 32)
!108 = !DIGlobalVariable(name: "camera.2", linkageName: "camera.2", scope: !0, file: !1, line: 21, type: !109, isLocal: false, isDefinition: true)
!109 = !DIDerivedType(tag: DW_TAG_member, name: ".2", baseType: !100, size: 32, align: 4, offset: 64)
!110 = !DIGlobalVariable(name: "skyBottom.0", linkageName: "skyBottom.0", scope: !0, file: !1, line: 24, type: !105, isLocal: false, isDefinition: true)
!111 = !DIGlobalVariable(name: "skyBottom.1", linkageName: "skyBottom.1", scope: !0, file: !1, line: 24, type: !107, isLocal: false, isDefinition: true)
!112 = !DIGlobalVariable(name: "skyBottom.2", linkageName: "skyBottom.2", scope: !0, file: !1, line: 24, type: !109, isLocal: false, isDefinition: true)
!113 = !DIGlobalVariable(name: "skyTop.0", linkageName: "skyTop.0", scope: !0, file: !1, line: 23, type: !105, isLocal: false, isDefinition: true)
!114 = !DIGlobalVariable(name: "skyTop.1", linkageName: "skyTop.1", scope: !0, file: !1, line: 23, type: !107, isLocal: false, isDefinition: true)
!115 = !DIGlobalVariable(name: "skyTop.2", linkageName: "skyTop.2", scope: !0, file: !1, line: 23, type: !109, isLocal: false, isDefinition: true)
!116 = !{i32 2, !"Dwarf Version", i32 4}
!117 = !{i32 2, !"Debug Info Version", i32 3}
!118 = !{!"dxcoob 1.8.2505.32 (b106a961d)"}
!119 = !{!"shader.hlsl", !"struct Payload // 32 bytes\0D\0A{\0D\0A    float3 color; // 12 bytes\0D\0A    float3 throughput; // 12 bytes\0D\0A    bool allowReflection; // 4 bytes\0D\0A    bool missed; // bytes\0D\0A};\0D\0Astruct Vertex\0D\0A{\0D\0A    float3 position;\0D\0A    float3 normal;\0D\0A    float2 texcoord;\0D\0A    uint materialIndex;\0D\0A};\0D\0A// UAV and SRVs\0D\0ARaytracingAccelerationStructure scene : register(t0, space0);\0D\0ARWTexture2D<float4> uav : register(u0, space0);\0D\0AStructuredBuffer<Vertex> VertexBuffers[] : register(t1, space1);\0D\0ABuffer<uint> IndexBuffers[] : register(t2, space2);\0D\0A// constants\0D\0Astatic const float3 camera = float3(0, 0, -7);\0D\0Astatic const float3 light = float3(0, 200, 0);\0D\0Astatic const float3 skyTop = float3(0.24, 0.44, 0.72);\0D\0Astatic const float3 skyBottom = float3(0.75, 0.86, 0.93);\0D\0A[shader(\22raygeneration\22)]\0D\0Avoid RayGeneration()\0D\0A{\0D\0A\C2\A0\C2\A0\C2\A0\C2\A0\0D\0A    uint2 idx = DispatchRaysIndex().xy;\0D\0A    float2 size = DispatchRaysDimensions().xy;\0D\0A\C2\A0\C2\A0\C2\A0\C2\A0\0D\0A    float2 uv = idx / size;\0D\0A    float3 target = float3((uv.x * 2 - 1) * 1.8 * (size.x / size.y), (1 - uv.y) * 4 - 2 + camera.y, 0);\0D\0A\C2\A0\C2\A0\C2\A0\C2\A0\0D\0A    RayDesc ray;\0D\0A    ray.Origin = camera;\0D\0A    ray.Direction = target - camera;\0D\0A    ray.TMin = 0.001;\0D\0A    ray.TMax = 1000;\0D\0A\C2\A0\C2\A0\C2\A0\C2\A0\0D\0A    Payload payload;\0D\0A    payload.allowReflection = true;\0D\0A    payload.missed = false;\0D\0A    payload.throughput = float3(1, 1, 1);\0D\0A    payload.color = float3(1, 1, 1);\0D\0A\C2\A0\C2\A0\C2\A0\C2\A0\0D\0A    TraceRay(scene, RAY_FLAG_NONE, 0xFF, 0, 0, 0, ray, payload);\0D\0A    uav[idx] = float4(payload.color, 1);\0D\0A}\0D\0A[shader(\22miss\22)]\0D\0Avoid Miss(inout Payload payload)\0D\0A{\0D\0A    float slope = normalize(WorldRayDirection()).y;\0D\0A    float t = saturate(slope * 5 + 0.5);\0D\0A    payload.color = lerp(skyBottom, skyTop, t);\0D\0A    payload.missed = true;\0D\0A}\0D\0Avoid Hit(inout Payload payload, float2 uv)\0D\0A{\0D\0A    uint instanceID = InstanceID();\0D\0A    uint prim = PrimitiveIndex();\0D\0A    uint geomIdx = GeometryIndex();\0D\0A\C2\A0\C2\A0\C2\A0\C2\A0\0D\0A\C2\A0\C2\A0\C2\A0\C2\A0// Fetch triangle indices\0D\0A    uint i0 = IndexBuffers[instanceID][prim * 3 + 0];\0D\0A    uint i1 = IndexBuffers[instanceID][prim * 3 + 1];\0D\0A    uint i2 = IndexBuffers[instanceID][prim * 3 + 2];\0D\0A\C2\A0\C2\A0\C2\A0\C2\A0\0D\0A\C2\A0\C2\A0\C2\A0\C2\A0// Fetch Verticies\0D\0A    Vertex v0 = VertexBuffers[instanceID][i0];\0D\0A    Vertex v1 = VertexBuffers[instanceID][i1];\0D\0A    Vertex v2 = VertexBuffers[instanceID][i2];\0D\0A\C2\A0\C2\A0\C2\A0\C2\A0\0D\0A\C2\A0\C2\A0\C2\A0\C2\A0// Interpolate normal from three vertices\0D\0A    float uv0 = 1.0f - uv.x - uv.y;\0D\0A    float3 normal = normalize(v0.normal * uv0 + v1.normal * uv.x + v2.normal * uv.y);\0D\0A    float3 worldNormal = normalize(mul(normal, (float3x3) ObjectToWorld4x3()));\0D\0A\C2\A0\C2\A0\C2\A0\C2\A0\0D\0A    float3 rayPos = WorldRayOrigin() + WorldRayDirection() * RayTCurrent();\0D\0A\C2\A0\C2\A0\C2\A0\C2\A0\0D\0A    float3 wi = WorldRayDirection() * -1;\0D\0A    wi = normalize(wi);\0D\0A\C2\A0\C2\A0\C2\A0\C2\A0\0D\0A    float3 throughput = dot(worldNormal, wi);\0D\0A\C2\A0\C2\A0\C2\A0\C2\A0\0D\0A    payload.color *= throughput;\0D\0A\C2\A0\C2\A0\C2\A0\C2\A0\0D\0A}\0D\0A[shader(\22closesthit\22)]\0D\0Avoid ClosestHit(inout Payload payload, BuiltInTriangleIntersectionAttributes attribs)\0D\0A{\0D\0A    float2 uv = attribs.barycentrics;\0D\0A    Hit(payload, uv);\0D\0A    return;\0D\0A\C2\A0\C2\A0\C2\A0\C2\A0\C2\A0\C2\A0\C2\A0\C2\A0\0D\0A\C2\A0\C2\A0\C2\A0\C2\A0\0D\0A}"}
!120 = !{!"shader.hlsl"}
!121 = !{!"-E", !"lib.no::entry", !"-T", !"lib_6_3", !"/Fo", !"C:\5CUsers\5Chazza\5Csource\5Crepos\5CDX12PathTracer\5Cx64\5CDebug\5Cshader.cso", !"/Od", !"/Zi", !"-Qembed_debug"}
!122 = !{i32 1, i32 3}
!123 = !{i32 1, i32 9}
!124 = !{!"lib", i32 6, i32 3}
!125 = !{!126, !133, null, null}
!126 = !{!127, !129, !131}
!127 = !{i32 0, %struct.RaytracingAccelerationStructure* @"\01?scene@@3URaytracingAccelerationStructure@@A", !"scene", i32 0, i32 0, i32 1, i32 16, i32 0, !128}
!128 = !{i32 0, i32 4}
!129 = !{i32 1, [0 x %"class.StructuredBuffer<Vertex>"]* @"\01?VertexBuffers@@3PAV?$StructuredBuffer@UVertex@@@@A", !"VertexBuffers", i32 1, i32 1, i32 -1, i32 12, i32 0, !130}
!130 = !{i32 1, i32 36}
!131 = !{i32 2, [0 x %"class.Buffer<unsigned int>"]* @"\01?IndexBuffers@@3PAV?$Buffer@I@@A", !"IndexBuffers", i32 2, i32 2, i32 -1, i32 10, i32 0, !132}
!132 = !{i32 0, i32 5}
!133 = !{!134}
!134 = !{i32 0, %"class.RWTexture2D<vector<float, 4> >"* @"\01?uav@@3V?$RWTexture2D@V?$vector@M$03@@@@A", !"uav", i32 0, i32 0, i32 1, i32 2, i1 false, i1 false, i1 false, !135}
!135 = !{i32 0, i32 9}
!136 = !{i32 0, %"class.StructuredBuffer<Vertex>" undef, !137, %struct.Vertex undef, !139, %struct.Payload undef, !144, %struct.BuiltInTriangleIntersectionAttributes undef, !149}
!137 = !{i32 44, !138}
!138 = !{i32 6, !"h", i32 3, i32 0}
!139 = !{i32 44, !140, !141, !142, !143}
!140 = !{i32 6, !"position", i32 3, i32 0, i32 7, i32 9}
!141 = !{i32 6, !"normal", i32 3, i32 16, i32 7, i32 9}
!142 = !{i32 6, !"texcoord", i32 3, i32 32, i32 7, i32 9}
!143 = !{i32 6, !"materialIndex", i32 3, i32 40, i32 7, i32 5}
!144 = !{i32 36, !145, !146, !147, !148}
!145 = !{i32 6, !"color", i32 3, i32 0, i32 7, i32 9}
!146 = !{i32 6, !"throughput", i32 3, i32 16, i32 7, i32 9}
!147 = !{i32 6, !"allowReflection", i32 3, i32 28, i32 7, i32 1}
!148 = !{i32 6, !"missed", i32 3, i32 32, i32 7, i32 1}
!149 = !{i32 8, !150}
!150 = !{i32 6, !"barycentrics", i32 3, i32 0, i32 7, i32 9}
!151 = !{i32 1, void ()* @"\01?RayGeneration@@YAXXZ", !152, void (%struct.Payload*)* @"\01?Miss@@YAXUPayload@@@Z", !154, void (%struct.Payload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ClosestHit@@YAXUPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !156}
!152 = !{!153}
!153 = !{i32 1, !2, !2}
!154 = !{!153, !155}
!155 = !{i32 2, !2, !2}
!156 = !{!153, !155, !157}
!157 = !{i32 0, !2, !2}
!158 = !{null, !"", null, !125, !159}
!159 = !{i32 0, i64 17}
!160 = !{void (%struct.Payload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ClosestHit@@YAXUPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !"\01?ClosestHit@@YAXUPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", null, null, !161}
!161 = !{i32 8, i32 10, i32 6, i32 32, i32 7, i32 8, i32 5, !162}
!162 = !{i32 0}
!163 = !{void (%struct.Payload*)* @"\01?Miss@@YAXUPayload@@@Z", !"\01?Miss@@YAXUPayload@@@Z", null, null, !164}
!164 = !{i32 8, i32 11, i32 6, i32 32, i32 5, !162}
!165 = !{void ()* @"\01?RayGeneration@@YAXXZ", !"\01?RayGeneration@@YAXXZ", null, null, !166}
!166 = !{i32 8, i32 7, i32 5, !162}
!167 = !DILocation(line: 47, column: 5, scope: !40)
!168 = !DILocation(line: 48, column: 5, scope: !40)
!169 = !DILocation(line: 29, column: 17, scope: !40)
!170 = !DILocation(line: 29, column: 11, scope: !40)
!171 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "idx", scope: !40, file: !1, line: 29, type: !172)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, line: 29, baseType: !173)
!173 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 29, size: 64, align: 32, elements: !174, templateParams: !177)
!174 = !{!175, !176}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !173, file: !1, line: 29, baseType: !73, size: 32, align: 32, flags: DIFlagPublic)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !173, file: !1, line: 29, baseType: !73, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!177 = !{!98, !63}
!178 = !DIExpression(DW_OP_bit_piece, 0, 32)
!179 = !DIExpression(DW_OP_bit_piece, 32, 32)
!180 = !DILocation(line: 30, column: 19, scope: !40)
!181 = !DILocation(line: 30, column: 12, scope: !40)
!182 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !40, file: !1, line: 30, type: !57)
!183 = !DILocation(line: 32, column: 17, scope: !40)
!184 = !DILocation(line: 32, column: 21, scope: !40)
!185 = !DILocation(line: 32, column: 12, scope: !40)
!186 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "uv", scope: !40, file: !1, line: 32, type: !57)
!187 = !DILocation(line: 33, column: 34, scope: !40)
!188 = !DILocation(line: 33, column: 38, scope: !40)
!189 = !DILocation(line: 33, column: 43, scope: !40)
!190 = !DILocation(line: 33, column: 59, scope: !40)
!191 = !DILocation(line: 33, column: 49, scope: !40)
!192 = !DILocation(line: 33, column: 73, scope: !40)
!193 = !DILocation(line: 33, column: 81, scope: !40)
!194 = !DILocation(line: 33, column: 85, scope: !40)
!195 = !DILocation(line: 33, column: 91, scope: !40)
!196 = !DILocation(line: 33, column: 89, scope: !40)
!197 = !DILocation(line: 33, column: 12, scope: !40)
!198 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "target", scope: !40, file: !1, line: 33, type: !4)
!199 = !DIExpression(DW_OP_bit_piece, 64, 32)
!200 = !DILocation(line: 36, column: 18, scope: !40)
!201 = !DILocation(line: 36, column: 16, scope: !40)
!202 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ray", scope: !40, file: !1, line: 35, type: !203)
!203 = !DICompositeType(tag: DW_TAG_structure_type, name: "RayDesc", file: !1, line: 35, size: 256, align: 32, elements: !204)
!204 = !{!205, !206, !207, !208}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "Origin", scope: !203, file: !1, line: 35, baseType: !5, size: 96, align: 32)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "TMin", scope: !203, file: !1, line: 35, baseType: !8, size: 32, align: 32, offset: 96)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "Direction", scope: !203, file: !1, line: 35, baseType: !5, size: 96, align: 32, offset: 128)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "TMax", scope: !203, file: !1, line: 35, baseType: !8, size: 32, align: 32, offset: 224)
!209 = !DILocation(line: 35, column: 13, scope: !40)
!210 = !DILocation(line: 37, column: 30, scope: !40)
!211 = !DILocation(line: 37, column: 28, scope: !40)
!212 = !DILocation(line: 37, column: 19, scope: !40)
!213 = !DIExpression(DW_OP_bit_piece, 128, 32)
!214 = !DIExpression(DW_OP_bit_piece, 160, 32)
!215 = !DIExpression(DW_OP_bit_piece, 192, 32)
!216 = !DILocation(line: 38, column: 14, scope: !40)
!217 = !DIExpression(DW_OP_bit_piece, 96, 32)
!218 = !DILocation(line: 39, column: 14, scope: !40)
!219 = !DIExpression(DW_OP_bit_piece, 224, 32)
!220 = !DILocation(line: 42, column: 29, scope: !40)
!221 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "payload", scope: !40, file: !1, line: 41, type: !47)
!222 = !DILocation(line: 41, column: 13, scope: !40)
!223 = !DILocation(line: 43, column: 20, scope: !40)
!224 = !DILocation(line: 44, column: 24, scope: !40)
!225 = !DIExpression(DW_OP_bit_piece, 96, 96)
!226 = !DILocation(line: 45, column: 19, scope: !40)
!227 = !DIExpression(DW_OP_bit_piece, 0, 96)
!228 = !DILocation(line: 48, column: 31, scope: !40)
!229 = !DILocation(line: 48, column: 22, scope: !40)
!230 = !DILocation(line: 48, column: 14, scope: !40)
!231 = !DILocation(line: 49, column: 1, scope: !40)
!232 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "payload", arg: 1, scope: !43, file: !1, line: 51, type: !47)
!233 = !DILocation(line: 51, column: 25, scope: !43)
!234 = !DILocation(line: 53, column: 29, scope: !43)
!235 = !DILocation(line: 53, column: 19, scope: !43)
!236 = !DILocation(line: 53, column: 11, scope: !43)
!237 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "slope", scope: !43, file: !1, line: 53, type: !8)
!238 = !DIExpression()
!239 = !DILocation(line: 54, column: 30, scope: !43)
!240 = !DILocation(line: 54, column: 34, scope: !43)
!241 = !DILocation(line: 54, column: 15, scope: !43)
!242 = !DILocation(line: 54, column: 11, scope: !43)
!243 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "t", scope: !43, file: !1, line: 54, type: !8)
!244 = !DILocation(line: 55, column: 37, scope: !43)
!245 = !DILocation(line: 55, column: 26, scope: !43)
!246 = !DILocation(line: 55, column: 21, scope: !43)
!247 = !DILocation(line: 55, column: 19, scope: !43)
!248 = !DILocation(line: 56, column: 20, scope: !43)
!249 = !DILocation(line: 57, column: 1, scope: !43)
!250 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "attribs", arg: 2, scope: !64, file: !1, line: 90, type: !67)
!251 = !DILocation(line: 90, column: 78, scope: !64)
!252 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "payload", arg: 1, scope: !64, file: !1, line: 90, type: !47)
!253 = !DILocation(line: 90, column: 31, scope: !64)
!254 = !DILocation(line: 92, column: 25, scope: !64)
!255 = !DILocation(line: 92, column: 12, scope: !64)
!256 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "uv", scope: !64, file: !1, line: 92, type: !57)
!257 = !DILocation(line: 93, column: 5, scope: !64)
!258 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "uv", arg: 2, scope: !54, file: !1, line: 58, type: !57)
!259 = !DILocation(line: 58, column: 40, scope: !54, inlinedAt: !260)
!260 = distinct !DILocation(line: 93, column: 5, scope: !64)
!261 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "payload", arg: 1, scope: !54, file: !1, line: 58, type: !47)
!262 = !DILocation(line: 58, column: 24, scope: !54, inlinedAt: !260)
!263 = !DILocation(line: 60, column: 23, scope: !54, inlinedAt: !260)
!264 = !DILocation(line: 60, column: 10, scope: !54, inlinedAt: !260)
!265 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "instanceID", scope: !54, file: !1, line: 60, type: !91)
!266 = !DILocation(line: 61, column: 17, scope: !54, inlinedAt: !260)
!267 = !DILocation(line: 61, column: 10, scope: !54, inlinedAt: !260)
!268 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "prim", scope: !54, file: !1, line: 61, type: !91)
